(function() {
    const data = [
    {
        "t": "შაბათ-კვირა ძალიან მოკლეა.",
        "tag": "Daily life",
        "h": [
            "რას აკეთებთ შაბათ-კვირას?",
            "როგორ გრძნობთ თავს კვირა საღამოს?",
            "რას გააკეთებდით სამდღიანი შაბათ-კვირა რომ გქონდეთ?",
            "მუშაობთ თუ სწავლობთ შაბათ-კვირას?",
            "როგორია თქვენთვის იდეალური შაბათ-კვირა?"
        ],
        "level": "elementary",
        "theme": "describing",
        "lang": "ka",
        "form": "phrase",
        "transcription": "",
        "emoji": "💬",
        "definitions": [
            {
                "examples": [],
                "text": "შაბათ-კვირა ძალიან მოკლეა."
            }
        ],
        "id": "ka_elementary_describing_010",
        "word": "შაბათ-კვირა ძალიან მოკლეა."
    },
    {
        "t": "დაგვიანება უზრდელობაა.",
        "tag": "Social life",
        "h": [
            "როგორც წესი, პუნქტუალური ხართ?",
            "რამდენ ხანს უცდით მეგობარს?",
            "ნორმალურია 10 წუთით დაგვიანება?",
            "მნიშვნელოვანია პუნქტუალურობა თქვენს კულტურაში?",
            "რას აკეთებთ, როცა ვინმე ძალიან აგვიანებს?"
        ],
        "level": "elementary",
        "theme": "describing",
        "lang": "ka",
        "form": "phrase",
        "transcription": "",
        "emoji": "💬",
        "definitions": [
            {
                "examples": [],
                "text": "დაგვიანება უზრდელობაა."
            }
        ],
        "id": "ka_elementary_describing_011",
        "word": "დაგვიანება უზრდელობაა."
    },
    {
        "t": "პატარა ქალაქებში ხალხი უფრო კეთილია.",
        "tag": "Society",
        "h": [
            "სად ცხოვრობთ — დაბაში თუ ქალაქში?",
            "არიან თქვენი მეზობლები მეგობრულები?",
            "ესაუბრება თუ არა ხალხი უცხოებს იქ, სადც ცხოვრობთ?",
            "გიცხოვრიათ ოდესმე სხვა ტიპის ადგილას?",
            "რა ხდის ადგილს მეგობრულს?"
        ],
        "level": "elementary",
        "theme": "describing",
        "lang": "ka",
        "form": "phrase",
        "transcription": "",
        "emoji": "💬",
        "definitions": [
            {
                "examples": [],
                "text": "პატარა ქალაქებში ხალხი უფრო კეთილია."
            }
        ],
        "id": "ka_elementary_describing_012",
        "word": "პატარა ქალაქებში ხალხი უფრო კეთილია."
    },
    {
        "t": "შინაური ცხოველის ყოლა უფრო ბედნიერს გხდის.",
        "tag": "Lifestyle",
        "h": [
            "გყავთ შინაური ცხოველი?",
            "რომელი შინაური ცხოველია საუკეთესო დაკავებული ადამიანისთვის?",
            "ძვირია შინაური ცხოველების შენახვა?",
            "შეიძლება თუ არა შინაური ცხოველი იყოს მეგობარი?",
            "რა უნდა გააკეთოთ შინაური ცხოველის კარგად მოსავლელად?"
        ],
        "level": "elementary",
        "theme": "describing",
        "lang": "ka",
        "form": "phrase",
        "transcription": "",
        "emoji": "💬",
        "definitions": [
            {
                "examples": [],
                "text": "შინაური ცხოველის ყოლა უფრო ბედნიერს გხდის."
            }
        ],
        "id": "ka_elementary_describing_013",
        "word": "შინაური ცხოველის ყოლა უფრო ბედნიერს გხდის."
    },
    {
        "t": "ფეხსაცმლით ადამიანზე ბევრის თქმა შეიძლება.",
        "tag": "People",
        "h": [
            "აქცევთ ყურადღებას ადამიანების ფეხსაცმელს?",
            "რას ამბობს თქვენი ფეხსაცმელი თქვენზე?",
            "მნიშვნელოვანია მოდა თქვენთვის?",
            "შეგიძლიათ განსაჯოთ ადამიანი მისი გარეგნობით?",
            "კიდევ რა გიამბობთ ადამიანის ხასიათის შესახებ?"
        ],
        "level": "elementary",
        "theme": "describing",
        "lang": "ka",
        "form": "phrase",
        "transcription": "",
        "emoji": "💬",
        "definitions": [
            {
                "examples": [],
                "text": "ფეხსაცმლით ადამიანზე ბევრის თქმა შეიძლება."
            }
        ],
        "id": "ka_elementary_describing_014",
        "word": "ფეხსაცმლით ადამიანზე ბევრის თქმა შეიძლება."
    },
    {
        "t": "რესტორანში მარტო ჭამა ნორმალურია.",
        "tag": "Social life",
        "h": [
            "გიჭამიათ ოდესმე მარტო რესტორანში?",
            "თავს კომფორტულად გრძნობთ?",
            "სხვა ადამიანებთან ერთად ჭამა ჯობია?",
            "ხედავთ ბევრ ადამიანს, რომელიც მარტო ჭამს?",
            "რას აკეთებთ, როცა მარტო ჭამთ?"
        ],
        "level": "elementary",
        "theme": "describing",
        "lang": "ka",
        "form": "phrase",
        "transcription": "",
        "emoji": "💬",
        "definitions": [
            {
                "examples": [],
                "text": "რესტორანში მარტო ჭამა ნორმალურია."
            }
        ],
        "id": "ka_elementary_describing_015",
        "word": "რესტორანში მარტო ჭამა ნორმალურია."
    },
    {
        "t": "ენის სწავლა უფრო ადვილია, როცა ახალგაზრდა ხარ.",
        "tag": "Language",
        "h": [
            "რამდენი წლის იყავით, როცა ამ ენის სწავლა დაიწყეთ?",
            "ფიქრობთ, რომ ასაკს აქვს მნიშვნელობა ენის სწავლისთვის?",
            "რა არის ყველაზე რთული ენის სწავლაში?",
            "იცნობთ ვინმეს, ვინც ენა ზრდასრულ ასაკში ისწავლა?",
            "რა გეხმარებათ ყველაზე მეტად სწავლისას?"
        ],
        "level": "elementary",
        "theme": "describing",
        "lang": "ka",
        "form": "phrase",
        "transcription": "",
        "emoji": "💬",
        "definitions": [
            {
                "examples": [],
                "text": "ენის სწავლა უფრო ადვილია, როცა ახალგაზრდა ხარ."
            }
        ],
        "id": "ka_elementary_describing_016",
        "word": "ენის სწავლა უფრო ადვილია, როცა ახალგაზრდა ხარ."
    },
    {
        "t": "საზოგადოებრივი ტრანსპორტი ჯობია საკუთარი ავტომობილის ყოლას.",
        "tag": "Lifestyle",
        "h": [
            "როგორ გადაადგილდებით თქვენს ქალაქში?",
            "კარგია საზოგადოებრივი ტრანსპორტი იქ, სადც ცხოვრობთ?",
            "რა პრობლემები ახლავს ავტომობილის ყოლას?",
            "ძვირია საზოგადოებრივი ტრანსპორტით მგზავრობა?",
            "რას შეცვლიდით ტრანსპორტში თქვენს ქალაქში?"
        ],
        "level": "elementary",
        "theme": "describing",
        "lang": "ka",
        "form": "phrase",
        "transcription": "",
        "emoji": "💬",
        "definitions": [
            {
                "examples": [],
                "text": "საზოგადოებრივი ტრანსპორტი ჯობია საკუთარი ავტომობილის ყოლას."
            }
        ],
        "id": "ka_elementary_describing_017",
        "word": "საზოგადოებრივი ტრანსპორტი ჯობია საკუთარი ავტომობილის ყოლას."
    },
    {
        "t": "ტელეფონით რთულია მოწყენილი იყო.",
        "tag": "Technology",
        "h": [
            "დღეში რამდენ საათს იყენებთ ტელეფონს?",
            "რისთვის იყენებთ მას ყველაზე ხშირად?",
            "გწყინდებოდათ სმარტფონების გამოჩენამდე?",
            "სასარგებლოა თუ არა ზოგჯერ მოწყენილობა?",
            "შეგეძლოთ ტელეფონი ერთი დღით სახლში დაგეტოვებინათ?"
        ],
        "level": "elementary",
        "theme": "describing",
        "lang": "ka",
        "form": "phrase",
        "transcription": "",
        "emoji": "💬",
        "definitions": [
            {
                "examples": [],
                "text": "ტელეფონით რთულია მოწყენილი იყო."
            }
        ],
        "id": "ka_elementary_describing_018",
        "word": "ტელეფონით რთულია მოწყენილი იყო."
    },
    {
        "t": "სახლში მომზადება ყოველთვის ჯობია გარეთ ჭამას.",
        "tag": "Food",
        "h": [
            "რამდენად ხშირად ამზადებთ სახლში?",
            "რა უფრო ადვილია — მომზადება თუ რესტორანში წასვლა?",
            "ძვირია გარეთ ჭამა იქ, სადც ცხოვრობთ?",
            "რომელია თქვენი საყვარელი რესტორანი?",
            "რომელია თქვენი საუკეთესო სახლში მომზადებული კერძი?"
        ],
        "level": "elementary",
        "theme": "describing",
        "lang": "ka",
        "form": "phrase",
        "transcription": "",
        "emoji": "💬",
        "definitions": [
            {
                "examples": [],
                "text": "სახლში მომზადება ყოველთვის ჯობია გარეთ ჭამას."
            }
        ],
        "id": "ka_elementary_describing_019",
        "word": "სახლში მომზადება ყოველთვის ჯობია გარეთ ჭამას."
    },
    {
        "t": "ყველამ უნდა სცადოს საზღვარგარეთ ცხოვრება ერთი წლის განმავლობაში.",
        "tag": "Travel",
        "h": [
            "გიცხოვრიათ სხვა ქვეყანაში?",
            "რა იქნებოდა რთული საზღვარგარეთ ცხოვრებაში?",
            "რა იქნებოდა საინტერესო?",
            "რომელ ქვეყანას აირჩევდით?",
            "ცვლის თუ არა საზღვარგარეთ ცხოვრება ადამიანს?"
        ],
        "level": "elementary",
        "theme": "describing",
        "lang": "ka",
        "form": "phrase",
        "transcription": "",
        "emoji": "💬",
        "definitions": [
            {
                "examples": [],
                "text": "ყველამ უნდა სცადოს საზღვარგარეთ ცხოვრება ერთი წლის განმავლობაში."
            }
        ],
        "id": "ka_elementary_describing_020",
        "word": "ყველამ უნდა სცადოს საზღვარგარეთ ცხოვრება ერთი წლის განმავლობაში."
    },
    {
        "t": "სუპერგმირები უფრო საინტერესოები არიან, ვიდრე ნამდვილი გმირები.",
        "tag": "Entertainment",
        "h": [
            "ვინ არის თქვენი საყვარელი სუპერგმირი?",
            "შეგიძლიათ გაიხსენოთ რეალური ცხოვრების გმირი?",
            "რა ხდის ვინმეს გმირად?",
            "რატომ უყვარს ხალხს სუპერგმირები?",
            "ნამდვილი გმირები უფრო მნიშვნელოვანია?"
        ],
        "level": "elementary",
        "theme": "describing",
        "lang": "ka",
        "form": "phrase",
        "transcription": "",
        "emoji": "💬",
        "definitions": [
            {
                "examples": [],
                "text": "სუპერგმირები უფრო საინტერესოები არიან, ვიდრე ნამდვილი გმირები."
            }
        ],
        "id": "ka_elementary_describing_021",
        "word": "სუპერგმირები უფრო საინტერესოები არიან, ვიდრე ნამდვილი გმირები."
    },
    {
        "t": "მნიშვნელოვანია ყოველ დილით საწოლის გასწორება.",
        "tag": "Daily life",
        "h": [
            "ასწორებთ საწოლს ყოველდღე?",
            "უფრო კარგად გაგრძნობინებთ თავს მოწესრიგებული ოთახი?",
            "მნიშვნელოვანია ეს თუ არა?",
            "როგორია თქვენი დილის რუტინა?",
            "რა პატარა ჩვევები გაქვთ?"
        ],
        "level": "elementary",
        "theme": "describing",
        "lang": "ka",
        "form": "phrase",
        "transcription": "",
        "emoji": "💬",
        "definitions": [
            {
                "examples": [],
                "text": "მნიშვნელოვანია ყოველ დილით საწოლის გასწორება."
            }
        ],
        "id": "ka_elementary_describing_022",
        "word": "მნიშვნელოვანია ყოველ დილით საწოლის გასწორება."
    },
    {
        "t": "შოპინგი ჰობია.",
        "tag": "Free time",
        "h": [
            "გსიამოვნებთ შოპინგი?",
            "ონლაინ ყიდულობთ თუ მაღაზიებში?",
            "რამდენ დროს ხარჯავთ შოპინგზე?",
            "დამამშვიდებელია შოპინგი?",
            "რას ყიდულობთ ყველაზე ხშირად?"
        ],
        "level": "elementary",
        "theme": "describing",
        "lang": "ka",
        "form": "phrase",
        "transcription": "",
        "emoji": "💬",
        "definitions": [
            {
                "examples": [],
                "text": "შოპინგი ჰობია."
            }
        ],
        "id": "ka_elementary_describing_023",
        "word": "შოპინგი ჰობია."
    },
    {
        "t": "მარტო მოგზაურობა ჯობია მეგობრებთან ერთად მოგზაურობას.",
        "tag": "Travel",
        "h": [
            "გიმოგზაურიათ მარტო?",
            "რა არის კარგი მარტო მოგზაურობაში?",
            "რა არის კარგი სხვებთან ერთად მოგზაურობაში?",
            "გრძნობთ თავს მარტოსულად, როცა მარტო მოგზაურობთ?",
            "რომელია თქვენი საუკეთესო მოგზაურობა?"
        ],
        "level": "elementary",
        "theme": "describing",
        "lang": "ka",
        "form": "phrase",
        "transcription": "",
        "emoji": "💬",
        "definitions": [
            {
                "examples": [],
                "text": "მარტო მოგზაურობა ჯობია მეგობრებთან ერთად მოგზაურობას."
            }
        ],
        "id": "ka_elementary_describing_024",
        "word": "მარტო მოგზაურობა ჯობია მეგობრებთან ერთად მოგზაურობას."
    }
];
    const lang = "ka";
    if (!window.speakingData) window.speakingData = {};
    if (!window.speakingData[lang]) window.speakingData[lang] = {};
    if (!window.speakingData[lang]["opinions"]) window.speakingData[lang]["opinions"] = [];
    window.speakingData[lang]["opinions"].push(...data);
})();