(function() {
    const pronouns = ["я", "ты", "он / она / оно", "мы", "вы", "они"];
    const data = [
        {
            "verb": "быть",
            "group": "неправильный",
            "classification": "irregular",
            "aspect": "stative",
            "level": "starter",
            "pronouns": pronouns,
            "tenses": {
                "present_simple": {
                    "positive": ["есть", "есть", "есть", "есть", "есть", "есть"],
                    "negative": ["нет", "нет", "нет", "нет", "нет", "нет"],
                    "question": ["есть я?", "есть ты?", "есть он?", "есть мы?", "есть вы?", "есть они?"]
                },
                "past_simple": {
                    "positive": ["был / была", "был / была", "был / была / было", "были", "были", "были"],
                    "negative": ["не был / не была", "не был / не была", "не был / не была / не было", "не были", "не были", "не были"],
                    "question": ["я был?", "ты был?", "он был?", "мы были?", "вы были?", "они были?"]
                },
                "future_simple": {
                    "positive": ["буду", "будешь", "будет", "будем", "будете", "будут"],
                    "negative": ["не буду", "не будешь", "не будет", "не будем", "не будете", "не будут"],
                    "question": ["буду я?", "будешь ты?", "будет он?", "будем мы?", "будете вы?", "будут они?"]
                }
            }
        },
        {
            "verb": "делать / сделать",
            "group": "Видовая пара (1 спр.)",
            "classification": "regular",
            "aspect": "action",
            "level": "starter",
            "pronouns": pronouns,
            "tenses": {
                "present_imperfective": {
                    "positive": ["делаю", "делаешь", "делает", "делаем", "делаете", "делают"],
                    "negative": ["не делаю", "не делаешь", "не делает", "не делаем", "не делаете", "не делают"],
                    "question": ["я делаю?", "ты делаешь?", "он делает?", "мы делаем?", "вы делаете?", "они делают?"]
                },
                "past_imperfective": {
                    "positive": ["делал / делала", "делал / делала", "делал / делала / делало", "делали", "делали", "делали"],
                    "negative": ["не делал / не делала", "не делал / не делала", "не делал / не делала / не делало", "не делали", "не делали", "не делали"],
                    "question": ["я делал?", "ты делал?", "он делал?", "мы делали?", "вы делали?", "они делали?"]
                },
                "future_perfective": {
                    "positive": ["сделаю", "сделаешь", "сделает", "сделаем", "сделаете", "сделают"],
                    "negative": ["не сделаю", "не сделаешь", "не сделает", "не сделаем", "не сделаете", "не сделают"],
                    "question": ["я сделаю?", "ты сделаешь?", "он сделает?", "мы сделаем?", "вы сделаете?", "они сделают?"]
                }
            }
        }
    ]
    const lang = "ru";
    window.grammarData = window.grammarData || {};
    window.grammarData[lang] = [...(window.grammarData[lang] || []), ...data];
})();
