(function() {
    const data = [
    {
        "verb": "быть",
        "group": "irregular",
        "classification": "irregular",
        "level": "starter",
        "pronouns": [
            "я",
            "ты",
            "он",
            "она",
            "оно",
            "мы",
            "вы",
            "они"
        ],
        "tenses": {
            "present_simple": {
                "positive": [
                    "есть",
                    "есть",
                    "есть",
                    "есть",
                    "есть",
                    "есть",
                    "есть",
                    "есть"
                ],
                "negative": [
                    "нет",
                    "нет",
                    "нет",
                    "нет",
                    "нет",
                    "нет",
                    "нет",
                    "нет"
                ],
                "question": [
                    "есть я",
                    "есть ты",
                    "есть он",
                    "есть она",
                    "есть оно",
                    "есть мы",
                    "есть вы",
                    "есть они"
                ]
            },
            "past_simple": {
                "positive": [
                    "был",
                    "был",
                    "был",
                    "была",
                    "было",
                    "были",
                    "были",
                    "были"
                ],
                "negative": [
                    "не был",
                    "не был",
                    "не был",
                    "не была",
                    "не было",
                    "не были",
                    "не были",
                    "не были"
                ],
                "question": [
                    "я был",
                    "ты был",
                    "он был",
                    "она была",
                    "оно было",
                    "мы были",
                    "вы были",
                    "они были"
                ]
            },
            "future_simple": {
                "positive": [
                    "буду",
                    "будешь",
                    "будет",
                    "будет",
                    "будет",
                    "будем",
                    "будете",
                    "будут"
                ],
                "negative": [
                    "не буду",
                    "не будешь",
                    "не будет",
                    "не будет",
                    "не будет",
                    "не будем",
                    "не будете",
                    "не будут"
                ],
                "question": [
                    "буду я",
                    "будешь ты",
                    "будет он",
                    "будет она",
                    "будет оно",
                    "будем мы",
                    "будете вы",
                    "будут они"
                ]
            }
        }
    },
    {
        "verb": "работать",
        "group": "1st conjugation",
        "classification": "regular",
        "level": "starter",
        "pronouns": [
            "я",
            "ты",
            "он",
            "она",
            "оно",
            "мы",
            "вы",
            "они"
        ],
        "tenses": {
            "present_simple": {
                "positive": [
                    "работаю",
                    "работаешь",
                    "работает",
                    "работает",
                    "работает",
                    "работаем",
                    "работаете",
                    "работают"
                ],
                "negative": [
                    "не работаю",
                    "не работаешь",
                    "не работает",
                    "не работает",
                    "не работает",
                    "не работаем",
                    "не работаете",
                    "не работают"
                ],
                "question": [
                    "я работаю",
                    "ты работаешь",
                    "он работает",
                    "она работает",
                    "оно работает",
                    "мы работаем",
                    "вы работаете",
                    "они работают"
                ]
            },
            "future_simple": {
                "positive": [
                    "буду работать",
                    "будешь работать",
                    "будет работать",
                    "будет работать",
                    "будет работать",
                    "будем работать",
                    "будете работать",
                    "будут работать"
                ],
                "negative": [
                    "не буду работать",
                    "не будешь работать",
                    "не будет работать",
                    "не будет работать",
                    "не будет работать",
                    "не будем работать",
                    "не будете работать",
                    "не будут работать"
                ],
                "question": [
                    "буду я работать",
                    "будешь ты работать",
                    "будет он работать",
                    "будет она работать",
                    "будет оно работать",
                    "будем мы работать",
                    "будете вы работать",
                    "будут они работать"
                ]
            }
        }
    },
    {
        "verb": "делать",
        "group": "1st conjugation",
        "classification": "regular",
        "level": "starter",
        "pronouns": [
            "я",
            "ты",
            "он",
            "она",
            "оно",
            "мы",
            "вы",
            "они"
        ],
        "tenses": {
            "present_simple": {
                "positive": [
                    "делаю",
                    "делаешь",
                    "делает",
                    "делает",
                    "делает",
                    "делаем",
                    "делаете",
                    "делают"
                ],
                "negative": [
                    "не делаю",
                    "не делаешь",
                    "не делает",
                    "не делает",
                    "не делает",
                    "не делаем",
                    "не делаете",
                    "не делают"
                ],
                "question": [
                    "я делаю",
                    "ты делаешь",
                    "он делает",
                    "она делает",
                    "оно делает",
                    "мы делаем",
                    "вы делаете",
                    "они делают"
                ]
            },
            "past_simple": {
                "positive": [
                    "делал",
                    "делал",
                    "делал",
                    "делала",
                    "делало",
                    "делали",
                    "делали",
                    "делали"
                ],
                "negative": [
                    "не делал",
                    "не делал",
                    "не делал",
                    "не делала",
                    "не делало",
                    "не делали",
                    "не делали",
                    "не делали"
                ],
                "question": [
                    "я делал",
                    "ты делал",
                    "он делал",
                    "она делала",
                    "оно делало",
                    "мы делали",
                    "вы делали",
                    "они делали"
                ]
            },
            "future_simple": {
                "positive": [
                    "буду делать",
                    "будешь делать",
                    "будет делать",
                    "будет делать",
                    "будет делать",
                    "будем делать",
                    "будете делать",
                    "будут делать"
                ],
                "negative": [
                    "не буду делать",
                    "не будешь делать",
                    "не будет делать",
                    "не будет делать",
                    "не будет делать",
                    "не будем делать",
                    "не будете делать",
                    "не будут делать"
                ],
                "question": [
                    "буду я делать",
                    "будешь ты делать",
                    "будет он делать",
                    "будет она делать",
                    "будет оно делать",
                    "будем мы делать",
                    "будете вы делать",
                    "будут они делать"
                ]
            }
        }
    },
    {
        "verb": "идти",
        "group": "1st conjugation (irregular)",
        "classification": "irregular",
        "level": "starter",
        "pronouns": [
            "я",
            "ты",
            "он",
            "она",
            "оно",
            "мы",
            "вы",
            "они"
        ],
        "tenses": {
            "present_simple": {
                "positive": [
                    "иду",
                    "идешь",
                    "идет",
                    "идет",
                    "идет",
                    "идем",
                    "идете",
                    "идут"
                ],
                "negative": [
                    "не иду",
                    "не идешь",
                    "не идет",
                    "не идет",
                    "не идет",
                    "не идем",
                    "не идете",
                    "не идут"
                ],
                "question": [
                    "я иду",
                    "ты идешь",
                    "он идет",
                    "она идет",
                    "оно идет",
                    "мы идем",
                    "вы идете",
                    "они идут"
                ]
            },
            "past_simple": {
                "positive": [
                    "шел",
                    "шел",
                    "шел",
                    "шла",
                    "шло",
                    "шли",
                    "шли",
                    "шли"
                ],
                "negative": [
                    "не шел",
                    "не шел",
                    "не шел",
                    "не шла",
                    "не шло",
                    "не шли",
                    "не шли",
                    "не шли"
                ],
                "question": [
                    "я шел",
                    "ты шел",
                    "он шел",
                    "она шла",
                    "оно шло",
                    "мы шли",
                    "вы шли",
                    "они шли"
                ]
            },
            "future_simple": {
                "positive": [
                    "буду идти",
                    "будешь идти",
                    "будет идти",
                    "будет идти",
                    "будет идти",
                    "будем идти",
                    "будете идти",
                    "будут идти"
                ],
                "negative": [
                    "не буду идти",
                    "не будешь идти",
                    "не будет идти",
                    "не будет идти",
                    "не будет идти",
                    "не будем идти",
                    "не будете идти",
                    "не будут идти"
                ],
                "question": [
                    "буду я идти",
                    "будешь ты идти",
                    "будет он идти",
                    "будет она идти",
                    "будет оно идти",
                    "будем мы идти",
                    "будете вы идти",
                    "будут они идти"
                ]
            }
        }
    },
    {
        "verb": "говорить",
        "group": "2nd conjugation",
        "classification": "regular",
        "level": "starter",
        "pronouns": [
            "я",
            "ты",
            "он",
            "она",
            "оно",
            "мы",
            "вы",
            "они"
        ],
        "tenses": {
            "present_simple": {
                "positive": [
                    "говорю",
                    "говоришь",
                    "говорит",
                    "говорит",
                    "говорит",
                    "говорим",
                    "говорите",
                    "говорят"
                ],
                "negative": [
                    "не говорю",
                    "не говоришь",
                    "не говорит",
                    "не говорит",
                    "не говорит",
                    "не говорим",
                    "не говорите",
                    "не говорят"
                ],
                "question": [
                    "я говорю",
                    "ты говоришь",
                    "он говорит",
                    "она говорит",
                    "оно говорит",
                    "мы говорим",
                    "вы говорите",
                    "они говорят"
                ]
            },
            "past_simple": {
                "positive": [
                    "говорил",
                    "говорил",
                    "говорил",
                    "говорила",
                    "говорило",
                    "говорили",
                    "говорили",
                    "говорили"
                ],
                "negative": [
                    "не говорил",
                    "не говорил",
                    "не говорил",
                    "не говорила",
                    "не говорило",
                    "не говорили",
                    "не говорили",
                    "не говорили"
                ],
                "question": [
                    "я говорил",
                    "ты говорил",
                    "он говорил",
                    "она говорила",
                    "оно говорило",
                    "мы говорили",
                    "вы говорили",
                    "они говорили"
                ]
            },
            "future_simple": {
                "positive": [
                    "буду говорить",
                    "будешь говорить",
                    "будет говорить",
                    "будет говорить",
                    "будет говорить",
                    "будем говорить",
                    "будете говорить",
                    "будут говорить"
                ],
                "negative": [
                    "не буду говорить",
                    "не будешь говорить",
                    "не будет говорить",
                    "не будет говорить",
                    "не будет говорить",
                    "не будем говорить",
                    "не будете говорить",
                    "не будут говорить"
                ],
                "question": [
                    "буду я говорить",
                    "будешь ты говорить",
                    "будет он говорить",
                    "будет она говорить",
                    "будет оно говорить",
                    "будем мы говорить",
                    "будете вы говорить",
                    "будут они говорить"
                ]
            }
        }
    }
];
    const lang = "ru";
    window.grammarData = window.grammarData || {};
    window.grammarData[lang] = [...(window.grammarData[lang] || []), ...data];
})();
