(function() {
    const data = [
    {
        "t": "Сез хәтерләгән яллар",
        "h": [
            "Сез кайда булдыгыз?",
            "Сез кем белән бардыгыз?",
            "Сез анда нәрсә эшләдегез?",
            "Һава торышы нинди иде?",
            "Иң яхшы мизгел нинди иде?"
        ],
        "level": "elementary",
        "theme": "travel",
        "lang": "tt",
        "form": "phrase",
        "transcription": "",
        "emoji": "💬",
        "definitions": [
            {
                "examples": [],
                "text": "Сез хәтерләгән яллар"
            }
        ],
        "id": "tt_elementary_travel_001",
        "word": "Сез хәтерләгән яллар"
    },
    {
        "t": "Сезнең яраткан рестораныгыз яисә кафегыз",
        "h": [
            "Ул кайда урнашкан?",
            "Анда нинди ризыклар бирелә?",
            "Ни өчен ул сезгә ошый?",
            "Сез анда кем белән барасыз?",
            "Соңгы тапкыр анда кайчан булдыгыз?"
        ],
        "level": "elementary",
        "theme": "food_drink",
        "lang": "tt",
        "form": "phrase",
        "transcription": "",
        "emoji": "💬",
        "definitions": [
            {
                "examples": [],
                "text": "Сезнең яраткан рестораныгыз яисә кафегыз"
            }
        ],
        "id": "tt_elementary_food_drink_001",
        "word": "Сезнең яраткан рестораныгыз яисә кафегыз"
    },
    {
        "t": "Сез эшкә яисә укырга ничек барасыз",
        "h": [
            "Сез ничек барасыз — автобус, машина яисә велосипед беләнме?",
            "Бу күпме вакыт ала?",
            "Сезгә юл ошыймы?",
            "Бу кыйбатмы?",
            "Юлда нәрсә эшлисез?"
        ],
        "level": "elementary",
        "theme": "travel",
        "lang": "tt",
        "form": "phrase",
        "transcription": "",
        "emoji": "💬",
        "definitions": [
            {
                "examples": [],
                "text": "Сез эшкә яисә укырга ничек барасыз"
            }
        ],
        "id": "tt_elementary_travel_002",
        "word": "Сез эшкә яисә укырга ничек барасыз"
    },
    {
        "t": "Ял итү өчен нәрсә эшлисез",
        "h": [
            "Ял итәргә сезгә нәрсә ярдәм итә?",
            "Сез ялгыз булырга яратасызмы яисә кешеләр беләнме?",
            "Сез никадәр еш чынлап ял итәсез?",
            "Ял итү өчен сезнең яраткан урыныгыз бармы?",
            "Ял итү җиңелме яисә сезгә бу авырмы?"
        ],
        "level": "elementary",
        "theme": "describing",
        "lang": "tt",
        "form": "phrase",
        "transcription": "",
        "emoji": "💬",
        "definitions": [
            {
                "examples": [],
                "text": "Ял итү өчен нәрсә эшлисез"
            }
        ],
        "id": "tt_elementary_describing_001",
        "word": "Ял итү өчен нәрсә эшлисез"
    },
    {
        "t": "Күптән түгел караган фильм",
        "h": [
            "Фильм ничек атала иде?",
            "Ул нәрсә турында иде?",
            "Сезгә ул ошадымы?",
            "Анда кем уйнады?",
            "Сез аны киңәш итәр идегезме?"
        ],
        "level": "elementary",
        "theme": "describing",
        "lang": "tt",
        "form": "phrase",
        "transcription": "",
        "emoji": "💬",
        "definitions": [
            {
                "examples": [],
                "text": "Күптән түгел караган фильм"
            }
        ],
        "id": "tt_elementary_describing_002",
        "word": "Күптән түгел караган фильм"
    },
    {
        "t": "Сезнең идеаль ял көннәрегез",
        "h": [
            "Җомга кичендә нәрсә эшләр идегез?",
            "Сез урамга чыгар идегезме яисә өйдә калыр идегезме?",
            "Сез берәр кайда сәяхәт итәр идегезме?",
            "Сез кем белән вакыт үткәрер идегез?",
            "Сез нәрсә ашар идегез?"
        ],
        "level": "elementary",
        "theme": "describing",
        "lang": "tt",
        "form": "phrase",
        "transcription": "",
        "emoji": "💬",
        "definitions": [
            {
                "examples": [],
                "text": "Сезнең идеаль ял көннәрегез"
            }
        ],
        "id": "tt_elementary_describing_003",
        "word": "Сезнең идеаль ял көннәрегез"
    },
    {
        "t": "Сез сокланган кеше",
        "h": [
            "Бу кеше кем?",
            "Ул нәрсә белән шөгыльләнә?",
            "Ни өчен сез аңа сокланасыз?",
            "Сез аны очраттыгызмы?",
            "Сез аннан нәрсәгә өйрәнә аласыз?"
        ],
        "level": "elementary",
        "theme": "people",
        "lang": "tt",
        "form": "phrase",
        "transcription": "",
        "emoji": "💬",
        "definitions": [
            {
                "examples": [],
                "text": "Сез сокланган кеше"
            }
        ],
        "id": "tt_elementary_people_001",
        "word": "Сез сокланган кеше"
    },
    {
        "t": "Сезнең хыялдагы сәяхәт урыныгыз",
        "h": [
            "Сез кайда барыр идегез?",
            "Ни өчен нәкъ менә бу урын?",
            "Сез кем белән барыр идегез?",
            "Сез анда нәрсә эшләр идегез?",
            "Сез анда күпме калыр идегез?"
        ],
        "level": "elementary",
        "theme": "travel",
        "lang": "tt",
        "form": "phrase",
        "transcription": "",
        "emoji": "💬",
        "definitions": [
            {
                "examples": [],
                "text": "Сезнең хыялдагы сәяхәт урыныгыз"
            }
        ],
        "id": "tt_elementary_travel_003",
        "word": "Сезнең хыялдагы сәяхәт урыныгыз"
    },
    {
        "t": "Сезнең телефон белән мөнәсәбәтегез",
        "h": [
            "Көненә ничә сәгать телефон кулланасыз?",
            "Сез аны күбрәк нәрсә өчен кулланасыз?",
            "Сез ансыз бер атна яши алыр идегезме?",
            "Ул сезгә ярдәм итәме яисә игътибарыгызны читкә юнәлтәме?",
            "Сез иртән торгач та аны тикшерәсезме?"
        ],
        "level": "elementary",
        "theme": "technology",
        "lang": "tt",
        "form": "phrase",
        "transcription": "",
        "emoji": "💬",
        "definitions": [
            {
                "examples": [],
                "text": "Сезнең телефон белән мөнәсәбәтегез"
            }
        ],
        "id": "tt_elementary_technology_001",
        "word": "Сезнең телефон белән мөнәсәбәтегез"
    },
    {
        "t": "Сезнең белән булган кызыклы хәл",
        "h": [
            "Бу кайчан булды?",
            "Сез кайда идегез?",
            "Сез кем белән идегез?",
            "Нәкъ нәрсә булды?",
            "Сез хәзер дә моңа көләсезме?"
        ],
        "level": "elementary",
        "theme": "describing",
        "lang": "tt",
        "form": "phrase",
        "transcription": "",
        "emoji": "💬",
        "definitions": [
            {
                "examples": [],
                "text": "Сезнең белән булган кызыклы хәл"
            }
        ],
        "id": "tt_elementary_describing_004",
        "word": "Сезнең белән булган кызыклы хәл"
    },
    {
        "t": "Сезнең хоббиларыгыз",
        "h": [
            "Буш вакытыгызда нәрсә эшлисез?",
            "Сез бу хобби белән кайчан шөгыльләнә башладыгыз?",
            "Сез аны ялгыз эшлисезме яисә башкалар беләнме?",
            "Бу кыйбатмы?",
            "Сез анда нәрсәне яратасыз?"
        ],
        "level": "elementary",
        "theme": "social",
        "lang": "tt",
        "form": "phrase",
        "transcription": "",
        "emoji": "💬",
        "definitions": [
            {
                "examples": [],
                "text": "Сезнең хоббиларыгыз"
            }
        ],
        "id": "tt_elementary_social_001",
        "word": "Сезнең хоббиларыгыз"
    },
    {
        "t": "Сез яшәгән урындагы һава торышы",
        "h": [
            "Һава торышы гадәттә нинди?",
            "Сез нинди һава торышын яратасыз?",
            "Һава торышы сезнең кәефегезгә йогынты ясыймы?",
            "Сез хәтерләгән иң начар һава торышы нинди иде?",
            "Яңгырлы көннәрдә нәрсә эшлисез?"
        ],
        "level": "elementary",
        "theme": "nature",
        "lang": "tt",
        "form": "phrase",
        "transcription": "",
        "emoji": "💬",
        "definitions": [
            {
                "examples": [],
                "text": "Сез яшәгән урындагы һава торышы"
            }
        ],
        "id": "tt_elementary_nature_001",
        "word": "Сез яшәгән урындагы һава торышы"
    },
    {
        "t": "Сез хәтерләгән туган көн",
        "h": [
            "Бу кемнең туган көне иде?",
            "Туган көн кайда үтте?",
            "Сез нәрсә эшләдегез?",
            "Сюрприз булдымы?",
            "Аны нәрсә үзенчәлекле итте?"
        ],
        "level": "elementary",
        "theme": "describing",
        "lang": "tt",
        "form": "phrase",
        "transcription": "",
        "emoji": "💬",
        "definitions": [
            {
                "examples": [],
                "text": "Сез хәтерләгән туган көн"
            }
        ],
        "id": "tt_elementary_describing_005",
        "word": "Сез хәтерләгән туган көн"
    },
    {
        "t": "Яшәгән урыныгызда сез яраткан әйберләр",
        "h": [
            "Шәһәрегездә сезнең иң яраткан әйберегез нинди?",
            "Бу гаиләләр өчен яхшы урынмы?",
            "Анда нәрсә эшләргә була?",
            "Сез нәрсә үзгәртер идегез?",
            "Сез аны дустыгызга киңәш итәр идегезме?"
        ],
        "level": "elementary",
        "theme": "places",
        "lang": "tt",
        "form": "phrase",
        "transcription": "",
        "emoji": "💬",
        "definitions": [
            {
                "examples": [],
                "text": "Яшәгән урыныгызда сез яраткан әйберләр"
            }
        ],
        "id": "tt_elementary_places_001",
        "word": "Яшәгән урыныгызда сез яраткан әйберләр"
    },
    {
        "t": "Гадәти якшәмбе",
        "h": [
            "Якшәмбе көнне сәгать ничәдә уянасыз?",
            "Сезнең көндәлек тәртибегез бармы?",
            "Сез зур аш пешерәсезме?",
            "Сез ял итәсезме яисә эш белән мәшгульсезме?",
            "Якшәмбе сезнең яраткан көнегезме?"
        ],
        "level": "elementary",
        "theme": "describing",
        "lang": "tt",
        "form": "phrase",
        "transcription": "",
        "emoji": "💬",
        "definitions": [
            {
                "examples": [],
                "text": "Гадәти якшәмбе"
            }
        ],
        "id": "tt_elementary_describing_006",
        "word": "Гадәти якшәмбе"
    },
    {
        "t": "Илегезнең ризыклары",
        "h": [
            "Милли ризык нинди?",
            "Сез аны өйдә пешерәсезме?",
            "Кешеләр аны кайчан ашый?",
            "Аны пешерү авырмы?",
            "Сез аны чит ил кешесенә киңәш итәр идегезме?"
        ],
        "level": "elementary",
        "theme": "describing",
        "lang": "tt",
        "form": "phrase",
        "transcription": "",
        "emoji": "💬",
        "definitions": [
            {
                "examples": [],
                "text": "Илегезнең ризыклары"
            }
        ],
        "id": "tt_elementary_describing_007",
        "word": "Илегезнең ризыклары"
    },
    {
        "t": "Күптән түгел сатып алынган әйбер",
        "h": [
            "Сез нәрсә сатып алдыгыз?",
            "Аны кайда сатып алдыгыз?",
            "Бу кыйбат идеме?",
            "Ул сезгә кирәк идеме яисә сез аны теләдегез генәме?",
            "Сез сатып алуга канәгатьме?"
        ],
        "level": "elementary",
        "theme": "describing",
        "lang": "tt",
        "form": "phrase",
        "transcription": "",
        "emoji": "💬",
        "definitions": [
            {
                "examples": [],
                "text": "Күптән түгел сатып алынган әйбер"
            }
        ],
        "id": "tt_elementary_describing_008",
        "word": "Күптән түгел сатып алынган әйбер"
    },
    {
        "t": "Сезнең яраткан кушымтагыз",
        "h": [
            "Сез нинди кушымтаны күбрәк кулланасыз?",
            "Сез аны нәрсә өчен кулланасыз?",
            "Сез аны кайчан куллана башладыгыз?",
            "Сез аны киңәш итәр идегезме?",
            "Сез ансыз яши алыр идегезме?"
        ],
        "level": "elementary",
        "theme": "technology",
        "lang": "tt",
        "form": "phrase",
        "transcription": "",
        "emoji": "💬",
        "definitions": [
            {
                "examples": [],
                "text": "Сезнең яраткан кушымтагыз"
            }
        ],
        "id": "tt_elementary_technology_002",
        "word": "Сезнең яраткан кушымтагыз"
    },
    {
        "t": "Балачак истәлеге",
        "h": [
            "Сезгә ничә яшь иде?",
            "Сез кайда идегез?",
            "Сез кем белән идегез?",
            "Нәрсә булды?",
            "Ни өчен сез аны хәтерлисез?"
        ],
        "level": "elementary",
        "theme": "describing",
        "lang": "tt",
        "form": "phrase",
        "transcription": "",
        "emoji": "💬",
        "definitions": [
            {
                "examples": [],
                "text": "Балачак истәлеге"
            }
        ],
        "id": "tt_elementary_describing_009",
        "word": "Балачак истәлеге"
    },
    {
        "t": "Кичә нәрсә ашадыгыз",
        "h": [
            "Иртәнге ашка нәрсә ашадыгыз?",
            "Төшке ашка нәрсә ашадыгыз?",
            "Сез үзегез пешердегезме яисә читтә ашадыгызмы?",
            "Бу ашау ягыннан гадәти көн идеме?",
            "Сез ашаган иң яхшы нәрсә нинди иде?"
        ],
        "level": "elementary",
        "theme": "food_drink",
        "lang": "tt",
        "form": "phrase",
        "transcription": "",
        "emoji": "💬",
        "definitions": [
            {
                "examples": [],
                "text": "Кичә нәрсә ашадыгыз"
            }
        ],
        "id": "tt_elementary_food_drink_002",
        "word": "Кичә нәрсә ашадыгыз"
    }
];
    const lang = "tt";
    if (!window.speakingData) window.speakingData = {};
    if (!window.speakingData[lang]) window.speakingData[lang] = {};
    if (!window.speakingData[lang]["talkThatTalk"]) window.speakingData[lang]["talkThatTalk"] = [];
    window.speakingData[lang]["talkThatTalk"].push(...data);
})();