(function() {
    const data = [
    {
        "t": "Ял көннәре бик кыска.",
        "tag": "Daily life",
        "h": [
            "Ял көннәрендә нәрсә эшлисез?",
            "Якшәмбе кичендә үзегезне ничек хис итәсез?",
            "Өч көнлек ял булса, нәрсә эшләр идегез?",
            "Ял көннәрендә эшлисезме яки укыйсызмы?",
            "Сезнең өчен идеаль ял көне нинди?"
        ],
        "level": "elementary",
        "theme": "describing",
        "lang": "tt",
        "form": "phrase",
        "transcription": "",
        "emoji": "💬",
        "definitions": [
            {
                "examples": [],
                "text": "Ял көннәре бик кыска."
            }
        ],
        "id": "tt_elementary_describing_010",
        "word": "Ял көннәре бик кыска."
    },
    {
        "t": "Соңга калу — әдәпсезлек.",
        "tag": "Social life",
        "h": [
            "Сез гадәттә вакытында киләсезме?",
            "Дустыгызны күпме көтәсез?",
            "10 минутка соңга калу нормальме?",
            "Сезнең мәдәниятегездә төгәллек мөһимме?",
            "Берәү бик соңга калса, нәрсә эшлисез?"
        ],
        "level": "elementary",
        "theme": "describing",
        "lang": "tt",
        "form": "phrase",
        "transcription": "",
        "emoji": "💬",
        "definitions": [
            {
                "examples": [],
                "text": "Соңга калу — әдәпсезлек."
            }
        ],
        "id": "tt_elementary_describing_011",
        "word": "Соңга калу — әдәпсезлек."
    },
    {
        "t": "Кечкенә шәһәрләрдә кешеләр мәхәббәтле.",
        "tag": "Society",
        "h": [
            "Сез кайда яшисез — авылдамы яки шәһәрдәме?",
            "Күршеләрегез дусмы?",
            "Сез яшәгән җирдә кешеләр таныш булмаганнар белән сөйләшәләрме?",
            "Сез кайчан да булса башка төрле җирдә яшәдегезме?",
            "Җирне нәрсә мәхәббәтле итә?"
        ],
        "level": "elementary",
        "theme": "describing",
        "lang": "tt",
        "form": "phrase",
        "transcription": "",
        "emoji": "💬",
        "definitions": [
            {
                "examples": [],
                "text": "Кечкенә шәһәрләрдә кешеләр мәхәббәтле."
            }
        ],
        "id": "tt_elementary_describing_012",
        "word": "Кечкенә шәһәрләрдә кешеләр мәхәббәтле."
    },
    {
        "t": "Йорт хайваны булу сезне бәхетле итә.",
        "tag": "Lifestyle",
        "h": [
            "Сезнең йорт хайваныгыз бармы?",
            "Мәшгуль кеше өчен нинди хайван иң яхшысы?",
            "Йорт хайваннары кыйммәтме?",
            "Йорт хайваны дус була аламы?",
            "Йорт хайванын яхшы карау өчен нәрсә эшләргә кирәк?"
        ],
        "level": "elementary",
        "theme": "describing",
        "lang": "tt",
        "form": "phrase",
        "transcription": "",
        "emoji": "💬",
        "definitions": [
            {
                "examples": [],
                "text": "Йорт хайваны булу сезне бәхетле итә."
            }
        ],
        "id": "tt_elementary_describing_013",
        "word": "Йорт хайваны булу сезне бәхетле итә."
    },
    {
        "t": "Аяк киеме буенча кеше турында күп нәрсә әйтеп була.",
        "tag": "People",
        "h": [
            "Сез кешеләрнең аяк киемнәренә карыйсызмы?",
            "Аяк киемегез сезнең турында нәрсә сөйли?",
            "Мода сезнең өчен мөһимме?",
            "Кешене тышкы кыяфәте буенча хөкем итеп буламы?",
            "Кешенең характеры турында тагын нәрсә сөйли?"
        ],
        "level": "elementary",
        "theme": "describing",
        "lang": "tt",
        "form": "phrase",
        "transcription": "",
        "emoji": "💬",
        "definitions": [
            {
                "examples": [],
                "text": "Аяк киеме буенча кеше турында күп нәрсә әйтеп була."
            }
        ],
        "id": "tt_elementary_describing_014",
        "word": "Аяк киеме буенча кеше турында күп нәрсә әйтеп була."
    },
    {
        "t": "Ресторанда берүзең ашау — нормаль.",
        "tag": "Social life",
        "h": [
            "Сез кайчан да булса ресторанда берүзегез ашадыгызмы?",
            "Сезгә бу уңайлымы?",
            "Башка кешеләр белән ашау яхшыракмы?",
            "Берүзе ашаучы кешеләрне күп күрәсезме?",
            "Берүзегез ашаганда нәрсә эшлисез?"
        ],
        "level": "elementary",
        "theme": "describing",
        "lang": "tt",
        "form": "phrase",
        "transcription": "",
        "emoji": "💬",
        "definitions": [
            {
                "examples": [],
                "text": "Ресторанда берүзең ашау — нормаль."
            }
        ],
        "id": "tt_elementary_describing_015",
        "word": "Ресторанда берүзең ашау — нормаль."
    },
    {
        "t": "Яшь чакта тел өйрәнү җиңелрәк.",
        "tag": "Language",
        "h": [
            "Бу телне өйрәнә башлаганда сезгә ничә яшь иде?",
            "Тел өйрәнү өчен яшь мөһим дип уйлыйсызмы?",
            "Тел өйрәнүнең иң авыр өлеше нинди?",
            "Олы яшьтә тел өйрәнгән берәр кешене беләсезме?",
            "Укыганда сезгә нәрсә иң күп ярдәм итә?"
        ],
        "level": "elementary",
        "theme": "describing",
        "lang": "tt",
        "form": "phrase",
        "transcription": "",
        "emoji": "💬",
        "definitions": [
            {
                "examples": [],
                "text": "Яшь чакта тел өйрәнү җиңелрәк."
            }
        ],
        "id": "tt_elementary_describing_016",
        "word": "Яшь чакта тел өйрәнү җиңелрәк."
    },
    {
        "t": "Җәмәгать транспорты автомобильгә караганда яхшырак.",
        "tag": "Lifestyle",
        "h": [
            "Шәһәрегездә ничек йөрисез?",
            "Сез яшәгән җирдә җәмәгать транспорты яхшымы?",
            "Автомобиль булуның нинди проблемалары бар?",
            "Җәмәгать транспортында йөрү кыйммәтме?",
            "Шәһәрегездәге транспортта нәрсә үзгәртер идегез?"
        ],
        "level": "elementary",
        "theme": "describing",
        "lang": "tt",
        "form": "phrase",
        "transcription": "",
        "emoji": "💬",
        "definitions": [
            {
                "examples": [],
                "text": "Җәмәгать транспорты автомобильгә караганда яхшырак."
            }
        ],
        "id": "tt_elementary_describing_017",
        "word": "Җәмәгать транспорты автомобильгә караганда яхшырак."
    },
    {
        "t": "Телефон булганда күңелсезләнү кыен.",
        "tag": "Technology",
        "h": [
            "Көненә ничә сәгать телефон кулланасыз?",
            "Аны күбрәк нәрсә өчен кулланасыз?",
            "Смартфоннар булганчы сезгә күңелсез идеме?",
            "Күңелсезләнү кайвакыт яхшымы?",
            "Телефоныгызны бер көнгә өйдә калдыра алыр идегезме?"
        ],
        "level": "elementary",
        "theme": "describing",
        "lang": "tt",
        "form": "phrase",
        "transcription": "",
        "emoji": "💬",
        "definitions": [
            {
                "examples": [],
                "text": "Телефон булганда күңелсезләнү кыен."
            }
        ],
        "id": "tt_elementary_describing_018",
        "word": "Телефон булганда күңелсезләнү кыен."
    },
    {
        "t": "Өйдә ашарга пешерү һәрвакыт тышта ашаудан яхшырак.",
        "tag": "Food",
        "h": [
            "Өйдә никадәр еш пешерәсез?",
            "Нәрсә җиңелрәк — пешерүме яки ресторанга барумы?",
            "Сез яшәгән җирдә тышта ашау кыйммәтме?",
            "Сезнең яраткан рестораныгыз нинди?",
            "Сезнең иң яхшы өй ризыгыгыз нинди?"
        ],
        "level": "elementary",
        "theme": "describing",
        "lang": "tt",
        "form": "phrase",
        "transcription": "",
        "emoji": "💬",
        "definitions": [
            {
                "examples": [],
                "text": "Өйдә ашарга пешерү һәрвакыт тышта ашаудан яхшырак."
            }
        ],
        "id": "tt_elementary_describing_019",
        "word": "Өйдә ашарга пешерү һәрвакыт тышта ашаудан яхшырак."
    },
    {
        "t": "Һәркем бер ел чит илдә яшәп карарга тиеш.",
        "tag": "Travel",
        "h": [
            "Сез башка илдә яшәдегезме?",
            "Чит илдә яшәүнең нәрсәсе авыр булыр иде?",
            "Нәрсәсе кызыклы булыр иде?",
            "Сез кайсы илне сайлар идегез?",
            "Чит илдә яшәү кешене үзгәртәме?"
        ],
        "level": "elementary",
        "theme": "describing",
        "lang": "tt",
        "form": "phrase",
        "transcription": "",
        "emoji": "💬",
        "definitions": [
            {
                "examples": [],
                "text": "Һәркем бер ел чит илдә яшәп карарга тиеш."
            }
        ],
        "id": "tt_elementary_describing_020",
        "word": "Һәркем бер ел чит илдә яшәп карарга тиеш."
    },
    {
        "t": "Супергеройлар реаль геройларга караганда кызыклырак.",
        "tag": "Entertainment",
        "h": [
            "Сезнең яраткан супергероегыз кем?",
            "Реаль тормыштан берәр геройны искә төшерә аласызмы?",
            "Кешене нәрсә герой итә?",
            "Ни өчен кешеләр супергеройларны яраталар?",
            "Реаль геройлар мөһимрәкме?"
        ],
        "level": "elementary",
        "theme": "describing",
        "lang": "tt",
        "form": "phrase",
        "transcription": "",
        "emoji": "💬",
        "definitions": [
            {
                "examples": [],
                "text": "Супергеройлар реаль геройларга караганда кызыклырак."
            }
        ],
        "id": "tt_elementary_describing_021",
        "word": "Супергеройлар реаль геройларга караганда кызыклырак."
    },
    {
        "t": "Һәр иртә урын-җирне җыеп кую мөһим.",
        "tag": "Daily life",
        "h": [
            "Сез көн саен урыныгызны җыясызмы?",
            "Җыелган бүлмә сезне яхшырак хис иттерәме?",
            "Бу мөһимме яки мөһим түгелме?",
            "Сезнең иртәнге гадәтләрегез нинди?",
            "Сезнең нинди кечкенә гадәтләрегез бар?"
        ],
        "level": "elementary",
        "theme": "describing",
        "lang": "tt",
        "form": "phrase",
        "transcription": "",
        "emoji": "💬",
        "definitions": [
            {
                "examples": [],
                "text": "Һәр иртә урын-җирне җыеп кую мөһим."
            }
        ],
        "id": "tt_elementary_describing_022",
        "word": "Һәр иртә урын-җирне җыеп кую мөһим."
    },
    {
        "t": "Шопинг — бу хобби.",
        "tag": "Free time",
        "h": [
            "Сезгә кибеткә йөрү ошыймы?",
            "Сез онлайнмы яки кибетләрдәме сатып аласыз?",
            "Шопингка күпме вакыт сарыф итәсез?",
            "Шопинг тынычландырамы?",
            "Нәрсәне ешрак сатып аласыз?"
        ],
        "level": "elementary",
        "theme": "describing",
        "lang": "tt",
        "form": "phrase",
        "transcription": "",
        "emoji": "💬",
        "definitions": [
            {
                "examples": [],
                "text": "Шопинг — бу хобби."
            }
        ],
        "id": "tt_elementary_describing_023",
        "word": "Шопинг — бу хобби."
    },
    {
        "t": "Берүзең сәяхәт итү дуслар белән сәяхәт итүдән яхшырак.",
        "tag": "Travel",
        "h": [
            "Сез берүзегез сәяхәт иттегезме?",
            "Берүзең сәяхәт итүнең нәрсәсе яхшы?",
            "Башкалар белән сәяхәт итүнең нәрсәсе яхшы?",
            "Берүзегез сәяхәт иткәндә үзегезне ялгыз хис итәсезме?",
            "Сезнең иң яхшы сәяхәтегез нинди иде?"
        ],
        "level": "elementary",
        "theme": "describing",
        "lang": "tt",
        "form": "phrase",
        "transcription": "",
        "emoji": "💬",
        "definitions": [
            {
                "examples": [],
                "text": "Берүзең сәяхәт итү дуслар белән сәяхәт итүдән яхшырак."
            }
        ],
        "id": "tt_elementary_describing_024",
        "word": "Берүзең сәяхәт итү дуслар белән сәяхәт итүдән яхшырак."
    }
];
    const lang = "tt";
    if (!window.speakingData) window.speakingData = {};
    if (!window.speakingData[lang]) window.speakingData[lang] = {};
    if (!window.speakingData[lang]["opinions"]) window.speakingData[lang]["opinions"] = [];
    window.speakingData[lang]["opinions"].push(...data);
})();