(function() {
    const data = [
    {
        "t": "Հանգստյան օրերը շատ կարճ են:",
        "tag": "Daily life",
        "h": [
            "Ի՞նչ եք անում հանգստյան օրերին:",
            "Ինչպե՞ս եք ձեզ զգում կիրակի երեկոյան:",
            "Ի՞նչ կանեիք եռօրյա հանգստյան օրերի դեպքում:",
            "Աշխատու՞մ եք, թե՞ սովորում հանգստյան օրերին:",
            "Ո՞րն է կատարյալ հանգստյան օրը ձեզ համար:"
        ],
        "level": "elementary",
        "theme": "describing",
        "lang": "hy",
        "form": "phrase",
        "transcription": "",
        "emoji": "💬",
        "definitions": [
            {
                "examples": [],
                "text": "Հանգստյան օրերը շատ կարճ են:"
            }
        ],
        "id": "hy_elementary_describing_010",
        "word": "Հանգստյան օրերը շատ կարճ են:"
    },
    {
        "t": "Ուշանալը անքաղաքավարություն է:",
        "tag": "Social life",
        "h": [
            "Սովորաբար ճիշտ ժամանակի՞ն եք գալիս:",
            "Որքա՞ն եք սպասում ընկերոջը:",
            "Արդյո՞ք նորմալ է 10 րոպե ուշանալը:",
            "Արդյո՞ք ճշտապահությունը կարևոր է ձեր մշակույթում:",
            "Ի՞նչ եք անում, երբ ինչ-որ մեկը շատ է ուշանում:"
        ],
        "level": "elementary",
        "theme": "describing",
        "lang": "hy",
        "form": "phrase",
        "transcription": "",
        "emoji": "💬",
        "definitions": [
            {
                "examples": [],
                "text": "Ուշանալը անքաղաքավարություն է:"
            }
        ],
        "id": "hy_elementary_describing_011",
        "word": "Ուշանալը անքաղաքավարություն է:"
    },
    {
        "t": "Մարդիկ ավելի բարի են փոքր քաղաքներում:",
        "tag": "Society",
        "h": [
            "Որտե՞ղ եք ապրում՝ գյուղու՞մ, թե՞ քաղաքում:",
            "Ձեր հարևանները բարեկամաբա՞ր են տրամադրված:",
            "Արդյո՞ք մարդիկ խոսում են անծանոթների հետ այնտեղ, որտեղ դուք ապրում եք:",
            "Երբևէ ապրե՞լ եք այլ տիպի վայրում:",
            "Ի՞նչն է վայրը դարձնում բարեկամական:"
        ],
        "level": "elementary",
        "theme": "describing",
        "lang": "hy",
        "form": "phrase",
        "transcription": "",
        "emoji": "💬",
        "definitions": [
            {
                "examples": [],
                "text": "Մարդիկ ավելի բարի են փոքր քաղաքներում:"
            }
        ],
        "id": "hy_elementary_describing_012",
        "word": "Մարդիկ ավելի բարի են փոքր քաղաքներում:"
    },
    {
        "t": "Ընտանի կենդանի ունենալը ձեզ ավելի երջանիկ է դարձնում:",
        "tag": "Lifestyle",
        "h": [
            "Ընտանի կենդանի ունե՞ք:",
            "Ո՞րն է լավագույն ընտանի կենդանին զբաղված մարդու համար:",
            "Արդյո՞ք ընտանի կենդանիները թանկ են:",
            "Կարո՞ղ է ընտանի կենդանին ընկեր լինել:",
            "Ի՞նչ է պետք անել ընտանի կենդանուն լավ խնամելու համար:"
        ],
        "level": "elementary",
        "theme": "describing",
        "lang": "hy",
        "form": "phrase",
        "transcription": "",
        "emoji": "💬",
        "definitions": [
            {
                "examples": [],
                "text": "Ընտանի կենդանի ունենալը ձեզ ավելի երջանիկ է դարձնում:"
            }
        ],
        "id": "hy_elementary_describing_013",
        "word": "Ընտանի կենդանի ունենալը ձեզ ավելի երջանիկ է դարձնում:"
    },
    {
        "t": "Կարելի է շատ բան իմանալ մարդու մասին նրա կոշիկներով:",
        "tag": "People",
        "h": [
            "Նայու՞մ եք մարդկանց կոշիկներին:",
            "Ի՞նչ են ձեր կոշիկները պատմում ձեր մասին:",
            "Արդյո՞ք նորաձևությունը կարևոր է ձեզ համար:",
            "Կարելի՞ է դատել մարդուն իր արտաքինով:",
            "Էլ ի՞նչն է ձեզ պատմում մարդու բնավորության մասին:"
        ],
        "level": "elementary",
        "theme": "describing",
        "lang": "hy",
        "form": "phrase",
        "transcription": "",
        "emoji": "💬",
        "definitions": [
            {
                "examples": [],
                "text": "Կարելի է շատ բան իմանալ մարդու մասին նրա կոշիկներով:"
            }
        ],
        "id": "hy_elementary_describing_014",
        "word": "Կարելի է շատ բան իմանալ մարդու մասին նրա կոշիկներով:"
    },
    {
        "t": "Նորմալ է ռեստորանում միայնակ ուտելը:",
        "tag": "Social life",
        "h": [
            "Երբևէ միայնակ կերե՞լ եք ռեստորանում:",
            "Դա ձեզ համար հարմա՞ր է:",
            "Արդյո՞ք ուտելիքն ավելի համեղ է այլ մարդկանց հետ:",
            "Տեսնու՞մ եք շատ մարդկանց, ովքեր միայնակ են ուտում:",
            "Ի՞նչ եք անում, երբ միայնակ եք ուտում:"
        ],
        "level": "elementary",
        "theme": "describing",
        "lang": "hy",
        "form": "phrase",
        "transcription": "",
        "emoji": "💬",
        "definitions": [
            {
                "examples": [],
                "text": "Նորմալ է ռեստորանում միայնակ ուտելը:"
            }
        ],
        "id": "hy_elementary_describing_015",
        "word": "Նորմալ է ռեստորանում միայնակ ուտելը:"
    },
    {
        "t": "Լեզու սովորելն ավելի հեշտ է, երբ երիտասարդ ես:",
        "tag": "Language",
        "h": [
            "Քանի՞ տարեկան էիք, երբ սկսեցիք սովորել այս լեզուն:",
            "Կարծում եք՝ տարիքը նշանակություն ունի՞ լեզու սովորելու համար:",
            "Ո՞րն է լեզու սովորելու ամենադժվար մասը:",
            "Ճանաչու՞մ եք որևէ մեկին, ով մեծահասակ տարիքում է լեզու սովորել:",
            "Ի՞նչն է ձեզ ամենաշատը օգնում սովորելիս:"
        ],
        "level": "elementary",
        "theme": "describing",
        "lang": "hy",
        "form": "phrase",
        "transcription": "",
        "emoji": "💬",
        "definitions": [
            {
                "examples": [],
                "text": "Լեզու սովորելն ավելի հեշտ է, երբ երիտասարդ ես:"
            }
        ],
        "id": "hy_elementary_describing_016",
        "word": "Լեզու սովորելն ավելի հեշտ է, երբ երիտասարդ ես:"
    },
    {
        "t": "Հասարակական տրանսպորտը ավելի լավ է, քան մեքենա ունենալը:",
        "tag": "Lifestyle",
        "h": [
            "Ինչպե՞ս եք տեղաշարժվում ձեր քաղաքում:",
            "Արդյո՞ք հասարակական տրանսպորտը լավն է այնտեղ, որտեղ դուք ապրում եք:",
            "Որո՞նք են մեքենա ունենալու խնդիրները:",
            "Արդյո՞ք թանկ է հասարակական տրանսպորտով ճամփորդելը:",
            "Ի՞նչ կփոխեիք ձեր քաղաքի տրանսպորտի մեջ:"
        ],
        "level": "elementary",
        "theme": "describing",
        "lang": "hy",
        "form": "phrase",
        "transcription": "",
        "emoji": "💬",
        "definitions": [
            {
                "examples": [],
                "text": "Հասարակական տրանսպորտը ավելի լավ է, քան մեքենա ունենալը:"
            }
        ],
        "id": "hy_elementary_describing_017",
        "word": "Հասարակական տրանսպորտը ավելի լավ է, քան մեքենա ունենալը:"
    },
    {
        "t": "Դժվար է ձանձրանալ, երբ հեռախոս ունես:",
        "tag": "Technology",
        "h": [
            "Օրական քանի՞ ժամ եք օգտագործում ձեր հեռախոսը:",
            "Ինչի՞ համար եք այն ամենաշատը օգտագործում:",
            "Ձանձրանու՞մ էիք մինչ սմարթֆոնների հայտնվելը:",
            "Արդյո՞ք ձանձրույթը երբեմն օգտակար է:",
            "Կարո՞ղ էիք ձեր հեռախոսը մեկ օրով տանը թողնել:"
        ],
        "level": "elementary",
        "theme": "describing",
        "lang": "hy",
        "form": "phrase",
        "transcription": "",
        "emoji": "💬",
        "definitions": [
            {
                "examples": [],
                "text": "Դժվար է ձանձրանալ, երբ հեռախոս ունես:"
            }
        ],
        "id": "hy_elementary_describing_018",
        "word": "Դժվար է ձանձրանալ, երբ հեռախոս ունես:"
    },
    {
        "t": "Տանը կերակուր պատրաստելը միշտ ավելի լավ է, քան դրսում ուտելը:",
        "tag": "Food",
        "h": [
            "Որքա՞ն հաճախ եք տանը կերակուր պատրաստում:",
            "Ի՞նչն է ավելի հեշտ՝ պատրաստե՞լը, թե՞ ռեստորան գնալը:",
            "Արդյո՞ք դրսում ուտելը թանկ է այնտեղ, որտեղ դուք ապրում եք:",
            "Ո՞րն է ձեր սիրելի ռեստորանը:",
            "Ո՞րն է ձեր լավագույն տնական կերակուրը:"
        ],
        "level": "elementary",
        "theme": "describing",
        "lang": "hy",
        "form": "phrase",
        "transcription": "",
        "emoji": "💬",
        "definitions": [
            {
                "examples": [],
                "text": "Տանը կերակուր պատրաստելը միշտ ավելի լավ է, քան դրսում ուտելը:"
            }
        ],
        "id": "hy_elementary_describing_019",
        "word": "Տանը կերակուր պատրաստելը միշտ ավելի լավ է, քան դրսում ուտելը:"
    },
    {
        "t": "Բոլորը պետք է փորձեն մեկ տարի ապրել արտերկրում:",
        "tag": "Travel",
        "h": [
            "Ապրե՞լ եք այլ երկրում:",
            "Ի՞նչը դժվար կլիներ արտերկրում ապրելու մեջ:",
            "Ի՞նչը հետաքրքիր կլիներ:",
            "Ո՞ր երկիրը կընտրեիք:",
            "Արդյո՞ք արտերկրում ապրելը փոխում է մարդուն:"
        ],
        "level": "elementary",
        "theme": "describing",
        "lang": "hy",
        "form": "phrase",
        "transcription": "",
        "emoji": "💬",
        "definitions": [
            {
                "examples": [],
                "text": "Բոլորը պետք է փորձեն մեկ տարի ապրել արտերկրում:"
            }
        ],
        "id": "hy_elementary_describing_020",
        "word": "Բոլորը պետք է փորձեն մեկ տարի ապրել արտերկրում:"
    },
    {
        "t": "Սուպերհերոսները ավելի հետաքրքիր են, քան իրական հերոսները:",
        "tag": "Entertainment",
        "h": [
            "Ո՞վ է ձեր սիրելի սուպերհերոսը:",
            "Կարո՞ղ եք մտաբերել իրական կյանքի հերոսի:",
            "Ի՞նչն է մարդուն դարձնում հերոս:",
            "Ինչու՞ են մարդիկ սիրում սուպերհերոսների:",
            "Արդյո՞ք իրական հերոսները ավելի կարևոր են:"
        ],
        "level": "elementary",
        "theme": "describing",
        "lang": "hy",
        "form": "phrase",
        "transcription": "",
        "emoji": "💬",
        "definitions": [
            {
                "examples": [],
                "text": "Սուպերհերոսները ավելի հետաքրքիր են, քան իրական հերոսները:"
            }
        ],
        "id": "hy_elementary_describing_021",
        "word": "Սուպերհերոսները ավելի հետաքրքիր են, քան իրական հերոսները:"
    },
    {
        "t": "Կարևոր է ամեն առավոտ հավաքել անկողինը:",
        "tag": "Daily life",
        "h": [
            "Ամեն օր հավաքու՞մ եք ձեր անկողինը:",
            "Արդյո՞ք կոկիկ սենյակը ձեզ ավելի լավ է զգալ տալիս:",
            "Սա կարևո՞ր է, թե՞ ոչ:",
            "Ո՞րն է ձեր առավոտյան առօրյան:",
            "Ի՞նչ փոքր սովորություններ ունեք:"
        ],
        "level": "elementary",
        "theme": "describing",
        "lang": "hy",
        "form": "phrase",
        "transcription": "",
        "emoji": "💬",
        "definitions": [
            {
                "examples": [],
                "text": "Կարևոր է ամեն առավոտ հավաքել անկողինը:"
            }
        ],
        "id": "hy_elementary_describing_022",
        "word": "Կարևոր է ամեն առավոտ հավաքել անկողինը:"
    },
    {
        "t": "Գնումներ կատարելը հոբբի է:",
        "tag": "Free time",
        "h": [
            "Հաճույք ստանու՞մ եք գնումներից:",
            "Գնումներ կատարում եք առցա՞նց, թե՞ խանութներում:",
            "Որքա՞ն ժամանակ եք ծախսում գնումների վրա:",
            "Արդյո՞ք գնումները հանգստացնող են:",
            "Ի՞նչ եք ամենահաճախը գնում:"
        ],
        "level": "elementary",
        "theme": "describing",
        "lang": "hy",
        "form": "phrase",
        "transcription": "",
        "emoji": "💬",
        "definitions": [
            {
                "examples": [],
                "text": "Գնումներ կատարելը հոբբի է:"
            }
        ],
        "id": "hy_elementary_describing_023",
        "word": "Գնումներ կատարելը հոբբի է:"
    },
    {
        "t": "Միայնակ ճամփորդելը ավելի լավ է, քան ընկերների հետ:",
        "tag": "Travel",
        "h": [
            "Ճամփորդե՞լ եք միայնակ:",
            "Ի՞նչն է լավ միայնակ ճամփորդելու մեջ:",
            "Ի՞նչն է լավ ուրիշների հետ ճամփորդելու մեջ:",
            "Ձեզ միայնակ զգու՞մ եք, երբ միայնակ եք ճամփորդում:",
            "Ո՞րն է ձեր լավագույն ուղևորությունը:"
        ],
        "level": "elementary",
        "theme": "describing",
        "lang": "hy",
        "form": "phrase",
        "transcription": "",
        "emoji": "💬",
        "definitions": [
            {
                "examples": [],
                "text": "Միայնակ ճամփորդելը ավելի լավ է, քան ընկերների հետ:"
            }
        ],
        "id": "hy_elementary_describing_024",
        "word": "Միայնակ ճամփորդելը ավելի լավ է, քան ընկերների հետ:"
    }
];
    const lang = "hy";
    if (!window.speakingData) window.speakingData = {};
    if (!window.speakingData[lang]) window.speakingData[lang] = {};
    if (!window.speakingData[lang]["opinions"]) window.speakingData[lang]["opinions"] = [];
    window.speakingData[lang]["opinions"].push(...data);
})();