(function() {
    const data = [
    {
        "t": "Һеҙ хәтерләгән ялдар",
        "h": [
            "Һеҙ ҡайҙа булдығыҙ?",
            "Һеҙ кем менән барҙығыҙ?",
            "Һеҙ анда нәрсә эшләнегеҙ?",
            "Һава торошо ниндәй ине?",
            "Иң яҡшы миҙгел ниндәй ине?"
        ],
        "level": "elementary",
        "theme": "travel",
        "lang": "ba",
        "form": "phrase",
        "transcription": "",
        "emoji": "💬",
        "definitions": [
            {
                "examples": [],
                "text": "Һеҙ хәтерләгән ялдар"
            }
        ],
        "id": "ba_elementary_travel_001",
        "word": "Һеҙ хәтерләгән ялдар"
    },
    {
        "t": "Һеҙҙең яратҡан ресторанығыҙ йәки кафеғыҙ",
        "h": [
            "Ул ҡайҙа урынлашҡан?",
            "Анда ниндәй ризыҡтар бирелә?",
            "Ни өсөн ул һеҙгә ошай?",
            "Һеҙ анда кем менән бараһығыҙ?",
            "Һуңғы тапҡыр анда ҡайсан булдығыҙ?"
        ],
        "level": "elementary",
        "theme": "food_drink",
        "lang": "ba",
        "form": "phrase",
        "transcription": "",
        "emoji": "💬",
        "definitions": [
            {
                "examples": [],
                "text": "Һеҙҙең яратҡан ресторанығыҙ йәки кафеғыҙ"
            }
        ],
        "id": "ba_elementary_food_drink_001",
        "word": "Һеҙҙең яратҡан ресторанығыҙ йәки кафеғыҙ"
    },
    {
        "t": "Һеҙ эшкә йәки уҡырға нисек бараһығыҙ",
        "h": [
            "Һеҙ нисек бараһығыҙ — автобус, машина йәки велосипед менәнме?",
            "Бу күпме ваҡыт ала?",
            "Һеҙгә юл ошаймы?",
            "Бу ҡиммәтме?",
            "Юлда нәрсә эшләйһегеҙ?"
        ],
        "level": "elementary",
        "theme": "travel",
        "lang": "ba",
        "form": "phrase",
        "transcription": "",
        "emoji": "💬",
        "definitions": [
            {
                "examples": [],
                "text": "Һеҙ эшкә йәки уҡырға нисек бараһығыҙ"
            }
        ],
        "id": "ba_elementary_travel_002",
        "word": "Һеҙ эшкә йәки уҡырға нисек бараһығыҙ"
    },
    {
        "t": "Ял итеү өсөн нәрсә эшләйһегеҙ",
        "h": [
            "Ял итергә һеҙгә нәрсә ярҙам итә?",
            "Һеҙ яңғыҙ булырға яратаһығыҙмы йәки кешеләр менәнме?",
            "Һеҙ никаҙар йыш чынлап ял итәһегеҙ?",
            "Ял итеү өсөн һеҙҙең яратҡан урынығыҙ бармы?",
            "Ял итеү еңелме йәки һеҙгә бу ауырмы?"
        ],
        "level": "elementary",
        "theme": "describing",
        "lang": "ba",
        "form": "phrase",
        "transcription": "",
        "emoji": "💬",
        "definitions": [
            {
                "examples": [],
                "text": "Ял итеү өсөн нәрсә эшләйһегеҙ"
            }
        ],
        "id": "ba_elementary_describing_001",
        "word": "Ял итеү өсөн нәрсә эшләйһегеҙ"
    },
    {
        "t": "Күптән түгел ҡараған фильм",
        "h": [
            "Фильм нисек атала ине?",
            "Ул нәрсә тураһында ине?",
            "Һеҙгә ул ошанымы?",
            "Анда кем уйнаны?",
            "Һеҙ аны кәңәш итер инегеҙме?"
        ],
        "level": "elementary",
        "theme": "describing",
        "lang": "ba",
        "form": "phrase",
        "transcription": "",
        "emoji": "💬",
        "definitions": [
            {
                "examples": [],
                "text": "Күптән түгел ҡараған фильм"
            }
        ],
        "id": "ba_elementary_describing_002",
        "word": "Күптән түгел ҡараған фильм"
    },
    {
        "t": "Һеҙҙең идеаль ял көндәрегеҙ",
        "h": [
            "Йомға кисендә нәрсә эшләп инегеҙ?",
            "Һеҙ урамға сығыр инегеҙме йәки өйҙә ҡалыр инегеҙме?",
            "Һеҙ берәр ҡайҙа сәйәхәт итер инегеҙме?",
            "Һеҙ кем менән ваҡыт үткәрер инегеҙ?",
            "Һеҙ нәрсә ашар инегеҙ?"
        ],
        "level": "elementary",
        "theme": "describing",
        "lang": "ba",
        "form": "phrase",
        "transcription": "",
        "emoji": "💬",
        "definitions": [
            {
                "examples": [],
                "text": "Һеҙҙең идеаль ял көндәрегеҙ"
            }
        ],
        "id": "ba_elementary_describing_003",
        "word": "Һеҙҙең идеаль ял көндәрегеҙ"
    },
    {
        "t": "Һеҙ һоҡланған кеше",
        "h": [
            "Бу кеше кем?",
            "Ул нәрсә менән шөғөлләнә?",
            "Ни өсөн һеҙ аңа һоҡланаһығыҙ?",
            "Һеҙ аны осраттығыҙмы?",
            "Һеҙ аннан нәрсәгә өйрәнә алаһығыҙ?"
        ],
        "level": "elementary",
        "theme": "people",
        "lang": "ba",
        "form": "phrase",
        "transcription": "",
        "emoji": "💬",
        "definitions": [
            {
                "examples": [],
                "text": "Һеҙ һоҡланған кеше"
            }
        ],
        "id": "ba_elementary_people_001",
        "word": "Һеҙ һоҡланған кеше"
    },
    {
        "t": "Һеҙҙең хыялдағы сәйәхәт урынығыҙ",
        "h": [
            "Һеҙ ҡайҙа барыр инегеҙ?",
            "Ни өсөн нәҡ менә бу урын?",
            "Һеҙ кем менән барыр инегеҙ?",
            "Һеҙ анда нәрсә эшләп инегеҙ?",
            "Һеҙ анда күпме ҡалыр инегеҙ?"
        ],
        "level": "elementary",
        "theme": "travel",
        "lang": "ba",
        "form": "phrase",
        "transcription": "",
        "emoji": "💬",
        "definitions": [
            {
                "examples": [],
                "text": "Һеҙҙең хыялдағы сәйәхәт урынығыҙ"
            }
        ],
        "id": "ba_elementary_travel_003",
        "word": "Һеҙҙең хыялдағы сәйәхәт урынығыҙ"
    },
    {
        "t": "Һеҙҙең телефон менән мөнәсәбәтегеҙ",
        "h": [
            "Көненә нисә сәғәт телефон ҡулланаһығыҙ?",
            "Һеҙ аны күберәк нәрсә өсөн ҡулланаһығыҙ?",
            "Һеҙ анһыҙ бер атна йәшәй алыр инегеҙме?",
            "Ул һеҙгә ярҙам итәме йәки иғтибарығыҙҙы ситкә йүнәлтәме?",
            "Һеҙ иртән торғас та аны тикшерәһегеҙме?"
        ],
        "level": "elementary",
        "theme": "technology",
        "lang": "ba",
        "form": "phrase",
        "transcription": "",
        "emoji": "💬",
        "definitions": [
            {
                "examples": [],
                "text": "Һеҙҙең телефон менән мөнәсәбәтегеҙ"
            }
        ],
        "id": "ba_elementary_technology_001",
        "word": "Һеҙҙең телефон менән мөнәсәбәтегеҙ"
    },
    {
        "t": "Һеҙҙең менән булған ҡыҙыҡлы хәл",
        "h": [
            "Бу ҡайсан булды?",
            "Һеҙ ҡайҙа инегеҙ?",
            "Һеҙ кем менән инегеҙ?",
            "Нәҡ нәрсә булды?",
            "Һеҙ хәҙер ҙә моңа көләһегеҙме?"
        ],
        "level": "elementary",
        "theme": "describing",
        "lang": "ba",
        "form": "phrase",
        "transcription": "",
        "emoji": "💬",
        "definitions": [
            {
                "examples": [],
                "text": "Һеҙҙең менән булған ҡыҙыҡлы хәл"
            }
        ],
        "id": "ba_elementary_describing_004",
        "word": "Һеҙҙең менән булған ҡыҙыҡлы хәл"
    },
    {
        "t": "Һеҙҙең хоббиларығыҙ",
        "h": [
            "Буш ваҡытығыҙҙа нәрсә эшләйһегеҙ?",
            "Һеҙ бу хобби менән ҡайсан шөғөлләнә башланығыҙ?",
            "Һеҙ аны яңғыҙ эшләйһегеҙме йәки башҡалар менәнме?",
            "Бу ҡиммәтме?",
            "Һеҙ анда нәрсәне яратаһығыҙ?"
        ],
        "level": "elementary",
        "theme": "social",
        "lang": "ba",
        "form": "phrase",
        "transcription": "",
        "emoji": "💬",
        "definitions": [
            {
                "examples": [],
                "text": "Һеҙҙең хоббиларығыҙ"
            }
        ],
        "id": "ba_elementary_social_001",
        "word": "Һеҙҙең хоббиларығыҙ"
    },
    {
        "t": "Һеҙ йәшәгән урындағы һава торошо",
        "h": [
            "Һава торошо ғәҙәттә ниндәй?",
            "Һеҙ ниндәй һава торошон яратаһығыҙ?",
            "Һава торошо һеҙҙең кәйефегеҙгә йоғонто яһаймы?",
            "Һеҙ хәтерләгән иң насар һава торошо ниндәй ине?",
            "Ямғырлы көндәргә нәрсә эшләйһегеҙ?"
        ],
        "level": "elementary",
        "theme": "nature",
        "lang": "ba",
        "form": "phrase",
        "transcription": "",
        "emoji": "💬",
        "definitions": [
            {
                "examples": [],
                "text": "Һеҙ йәшәгән урындағы һава торошо"
            }
        ],
        "id": "ba_elementary_nature_001",
        "word": "Һеҙ йәшәгән урындағы һава торошо"
    },
    {
        "t": "Һеҙ хәтерләгән тыуған көн",
        "h": [
            "Бу кемдең тыуған көнө ине?",
            "Тыуған көн ҡайҙа үтте?",
            "Һеҙ нәрсә эшләнегеҙ?",
            "Сюрприз булдымы?",
            "Аны нәрсә үҙенсәлекле итте?"
        ],
        "level": "elementary",
        "theme": "describing",
        "lang": "ba",
        "form": "phrase",
        "transcription": "",
        "emoji": "💬",
        "definitions": [
            {
                "examples": [],
                "text": "Һеҙ хәтерләгән тыуған көн"
            }
        ],
        "id": "ba_elementary_describing_005",
        "word": "Һеҙ хәтерләгән тыуған көн"
    },
    {
        "t": "Йәшәгән урынығыҙҙа һеҙ яратҡан әйберҙәр",
        "h": [
            "Ҡалағыҙҙа һеҙҙең иң яратҡан әйберегеҙ ниндәй?",
            "Бу ғаиләләр өсөн яҡшы урынмы?",
            "Анда нәрсә эшләргә була?",
            "Һеҙ нәрсә үҙгәртер инегеҙ?",
            "Һеҙ аны дуҫығыҙға кәңәш итер инегеҙме?"
        ],
        "level": "elementary",
        "theme": "places",
        "lang": "ba",
        "form": "phrase",
        "transcription": "",
        "emoji": "💬",
        "definitions": [
            {
                "examples": [],
                "text": "Йәшәгән урынығыҙҙа һеҙ яратҡан әйберҙәр"
            }
        ],
        "id": "ba_elementary_places_001",
        "word": "Йәшәгән урынығыҙҙа һеҙ яратҡан әйберҙәр"
    },
    {
        "t": "Ғәҙәти йәкшәмбе",
        "h": [
            "Йәкшәмбе көнө сәғәт нисәлә уянаһығыҙ?",
            "Һеҙҙең көндәлек тәртибегеҙ бармы?",
            "Һеҙ ҙур аш бешерәһегеҙме?",
            "Һеҙ ял итәһегеҙме йәки эш менән мәшғүлһегеҙме?",
            "Йәкшәмбе һеҙҙең яратҡан көнөгөҙмө?"
        ],
        "level": "elementary",
        "theme": "describing",
        "lang": "ba",
        "form": "phrase",
        "transcription": "",
        "emoji": "💬",
        "definitions": [
            {
                "examples": [],
                "text": "Ғәҙәти йәкшәмбе"
            }
        ],
        "id": "ba_elementary_describing_006",
        "word": "Ғәҙәти йәкшәмбе"
    },
    {
        "t": "Илегеҙҙең ризыҡтары",
        "h": [
            "Милли ризыҡ ниндәй?",
            "Һеҙ аны өйҙә бешерәһегеҙме?",
            "Кешеләр аны ҡайсан ашай?",
            "Аны бешереү ауырмы?",
            "Һеҙ аны сит ил кешеһенә кәңәш итер инегеҙме?"
        ],
        "level": "elementary",
        "theme": "describing",
        "lang": "ba",
        "form": "phrase",
        "transcription": "",
        "emoji": "💬",
        "definitions": [
            {
                "examples": [],
                "text": "Илегеҙҙең ризыҡтары"
            }
        ],
        "id": "ba_elementary_describing_007",
        "word": "Илегеҙҙең ризыҡтары"
    },
    {
        "t": "Күптән түгел һатып алынған әйбер",
        "h": [
            "Һеҙ нәрсә һатып алдығыҙ?",
            "Аны ҡайҙа һатып алдығыҙ?",
            "Бу ҡиммәт инеме?",
            "Ул һеҙгә кәрәк инеме йәки һеҙ аны теләнегеҙ генәме?",
            "Һеҙ һатып алыуға ҡәнәғәтме?"
        ],
        "level": "elementary",
        "theme": "describing",
        "lang": "ba",
        "form": "phrase",
        "transcription": "",
        "emoji": "💬",
        "definitions": [
            {
                "examples": [],
                "text": "Күптән түгел һатып алынған әйбер"
            }
        ],
        "id": "ba_elementary_describing_008",
        "word": "Күптән түгел һатып алынған әйбер"
    },
    {
        "t": "Һеҙҙең яратҡан ҡушымтағыҙ",
        "h": [
            "Һеҙ ниндәй ҡушымтаны күбрәк ҡулланаһығыҙ?",
            "Һеҙ аны нәрсә өсөн ҡулланаһығыҙ?",
            "Һеҙ аны ҡайсан ҡуллана башланығыҙ?",
            "Һеҙ аны кәңәш итер инегеҙме?",
            "Һеҙ анһыҙ йәшәй алыр инегеҙме?"
        ],
        "level": "elementary",
        "theme": "technology",
        "lang": "ba",
        "form": "phrase",
        "transcription": "",
        "emoji": "💬",
        "definitions": [
            {
                "examples": [],
                "text": "Һеҙҙең яратҡан ҡушымтағыҙ"
            }
        ],
        "id": "ba_elementary_technology_002",
        "word": "Һеҙҙең яратҡан ҡушымтағыҙ"
    },
    {
        "t": "Бала саҡ иҫтәлеге",
        "h": [
            "Һеҙгә нисә йәш ине?",
            "Һеҙ ҡайҙа инегеҙ?",
            "Һеҙ кем менән инегеҙ?",
            "Нәрсе булды?",
            "Ни өсөн һеҙ аны хәтерләйһегеҙ?"
        ],
        "level": "elementary",
        "theme": "describing",
        "lang": "ba",
        "form": "phrase",
        "transcription": "",
        "emoji": "💬",
        "definitions": [
            {
                "examples": [],
                "text": "Бала саҡ иҫтәлеге"
            }
        ],
        "id": "ba_elementary_describing_009",
        "word": "Бала саҡ иҫтәлеге"
    },
    {
        "t": "Кисә нәрсә ашанығыҙ",
        "h": [
            "Иртәнге ашҡа нәрсә ашанығыҙ?",
            "Төшкө ашҡа нәрсә ашанығыҙ?",
            "Һеҙ үҙегеҙ бешерҙегеҙме йәки ситтә ашанығыҙмы?",
            "Бу ашау яғынан ғәҙәти көн инеме?",
            "Һеҙ ашаған иң яҡшы нәрсә ниндәй ине?"
        ],
        "level": "elementary",
        "theme": "food_drink",
        "lang": "ba",
        "form": "phrase",
        "transcription": "",
        "emoji": "💬",
        "definitions": [
            {
                "examples": [],
                "text": "Кисә нәрсә ашанығыҙ"
            }
        ],
        "id": "ba_elementary_food_drink_002",
        "word": "Кисә нәрсә ашанығыҙ"
    }
];
    const lang = "ba";
    if (!window.speakingData) window.speakingData = {};
    if (!window.speakingData[lang]) window.speakingData[lang] = {};
    if (!window.speakingData[lang]["talkThatTalk"]) window.speakingData[lang]["talkThatTalk"] = [];
    window.speakingData[lang]["talkThatTalk"].push(...data);
})();