(function() {
    const data = [
    {
        "t": "Ял көндәре бик ҡыҫҡа.",
        "tag": "Daily life",
        "h": [
            "Ял көндәрендә нәмә эшләйһегеҙ?",
            "Йәкшәмбе кисендә үҙегеҙҙе нисек хис итәһегеҙ?",
            "Өс көнлөк ял булһа, нәмә эшләр инегеҙ?",
            "Ял көндәрендә эшләйһегеҙме яки уҡыйһығыҙмы?",
            "Ыеҙҙең өсөн идеаль ял көнө нинди?"
        ],
        "level": "elementary",
        "theme": "describing",
        "lang": "ba",
        "form": "phrase",
        "transcription": "",
        "emoji": "💬",
        "definitions": [
            {
                "examples": [],
                "text": "Ял көндәре бик ҡыҫҡа."
            }
        ],
        "id": "ba_elementary_describing_010",
        "word": "Ял көндәре бик ҡыҫҡа."
    },
    {
        "t": "Һуңға ҡалыу — әҙәпһеҙлек.",
        "tag": "Social life",
        "h": [
            "Ыеҙ ғәҙәттә ваҡытында киләһегеҙме?",
            "Дуҫығыҙҙы ҡасанға тиклем көтәһегеҙ?",
            "10 минутҡа һуңға ҡалыу нормальме?",
            "Ыеҙҙең мәҙәниәтегеҙҙә төгәллек мөһимме?",
            "Берәү бик һуңға ҡалһа, нәмә эшләйһегеҙ?"
        ],
        "level": "elementary",
        "theme": "describing",
        "lang": "ba",
        "form": "phrase",
        "transcription": "",
        "emoji": "💬",
        "definitions": [
            {
                "examples": [],
                "text": "Һуңға ҡалыу — әҙәпһеҙлек."
            }
        ],
        "id": "ba_elementary_describing_011",
        "word": "Һуңға ҡалыу — әҙәпһеҙлек."
    },
    {
        "t": "Кескәй ҡалаларҙа кешеләр мәхәббәтлерәк.",
        "tag": "Society",
        "h": [
            "Ыеҙ ҡайҙа йәшәйһегеҙ — ауылдамы яки ҡалаламы?",
            "Күршеләрегеҙ дуҫмы?",
            "Ыеҙ йәшәгән ерҙә кешеләр таныш булмағандар менән һөйләшәләрме?",
            "Ыеҙ ҡасан да булһа башқа төрлө ерҙә йәшәнегеҙме?",
            "Ерҙе нәмә мәхәббәтле итә?"
        ],
        "level": "elementary",
        "theme": "describing",
        "lang": "ba",
        "form": "phrase",
        "transcription": "",
        "emoji": "💬",
        "definitions": [
            {
                "examples": [],
                "text": "Кескәй ҡалаларҙа кешеләр мәхәббәтлерәк."
            }
        ],
        "id": "ba_elementary_describing_012",
        "word": "Кескәй ҡалаларҙа кешеләр мәхәббәтлерәк."
    },
    {
        "t": "Йорт хайуаны булыуы ыеҙҙе бәхетлерәк итә.",
        "tag": "Lifestyle",
        "h": [
            "Ыеҙҙең йорт хайуанығыҙ бармы?",
            "Мәшғүл кеше өсөн нинди хайуан иң яхшыһы?",
            "Йорт хайуандары ҡыйбатмы?",
            "Йорт хайуаны дуҫ була аламы?",
            "Йорт хайуанын яхшы ҡарау өсөн нәмә эшләргә кәрәк?"
        ],
        "level": "elementary",
        "theme": "describing",
        "lang": "ba",
        "form": "phrase",
        "transcription": "",
        "emoji": "💬",
        "definitions": [
            {
                "examples": [],
                "text": "Йорт хайуаны булыуы ыеҙҙе бәхетлерәк итә."
            }
        ],
        "id": "ba_elementary_describing_013",
        "word": "Йорт хайуаны булыуы ыеҙҙе бәхетлерәк итә."
    },
    {
        "t": "Аяҡ кейеме буйынса кеше тураһында күп нәмә әйтеп була.",
        "tag": "People",
        "h": [
            "Ыеҙ кешеләрҙең аяҡ кейемдәренә ҡараһығыҙмы?",
            "Аяҡ кейемегеҙ ыеҙҙең турала нәмә һөйләй?",
            "Мода ыеҙҙең өсөн мөһимме?",
            "Кешене тышҡы ҡиәфәте буйынса хөкөм итеп буламы?",
            "Кешенең характеры тураһында тағы нәмә һөйләй?"
        ],
        "level": "elementary",
        "theme": "describing",
        "lang": "ba",
        "form": "phrase",
        "transcription": "",
        "emoji": "💬",
        "definitions": [
            {
                "examples": [],
                "text": "Аяҡ кейеме буйынса кеше тураһында күп нәмә әйтеп була."
            }
        ],
        "id": "ba_elementary_describing_014",
        "word": "Аяҡ кейеме буйынса кеше тураһында күп нәмә әйтеп була."
    },
    {
        "t": "Ресторанда бер үҙең ашау — нормаль.",
        "tag": "Social life",
        "h": [
            "Ыеҙ ҡасан да булһа ресторанда бер үҙегеҙ ашанығыҙмы?",
            "Ыеҙгә бу уңайлымы?",
            "Башҡа кешеләр менән ашау яхшыраҡмы?",
            "Бер үҙе ашаусы кешеләрҙе күп күрәһегеҙме?",
            "Бер үҙегеҙ ашағанда нәмә эшләйһегеҙ?"
        ],
        "level": "elementary",
        "theme": "describing",
        "lang": "ba",
        "form": "phrase",
        "transcription": "",
        "emoji": "💬",
        "definitions": [
            {
                "examples": [],
                "text": "Ресторанда бер үҙең ашау — нормаль."
            }
        ],
        "id": "ba_elementary_describing_015",
        "word": "Ресторанда бер үҙең ашау — нормаль."
    },
    {
        "t": "Йәш саҡта тел өйрәнеү еңелерәк.",
        "tag": "Language",
        "h": [
            "Бу телде өйрәнә башлағанда ыеҙгә нисә йәш ине?",
            "Тел өйрәнеү өсөн йәш мөһим тип уйлайһығыҙмы?",
            "Тел өйрәнеүҙең иң ауыр өлөшө нинди?",
            "Олы йәштә тел өйрәнгән берәр кешене белһегеҙме?",
            "Уҡығанда ыеҙгә нәмә иң күп ярҙам итә?"
        ],
        "level": "elementary",
        "theme": "describing",
        "lang": "ba",
        "form": "phrase",
        "transcription": "",
        "emoji": "💬",
        "definitions": [
            {
                "examples": [],
                "text": "Йәш саҡта тел өйрәнеү еңелерәк."
            }
        ],
        "id": "ba_elementary_describing_016",
        "word": "Йәш саҡта тел өйрәнеү еңелерәк."
    },
    {
        "t": "Йәмәғәт транспорты автомобилгә ҡарағанда яхшыраҡ.",
        "tag": "Lifestyle",
        "h": [
            "Ҡалағыҙҙа нисек йөрөйһегеҙ?",
            "Ыеҙ йәшәгән ерҙә йәмәғәт транспорты яхшымы?",
            "Автомобиль булыуҙың нинди проблемалары бар?",
            "Йәмәғәт транспортында йөрөү ҡыйбатмы?",
            "Ҡалағыҙҙағы транспортта нәмә үҙгәртер инегеҙ?"
        ],
        "level": "elementary",
        "theme": "describing",
        "lang": "ba",
        "form": "phrase",
        "transcription": "",
        "emoji": "💬",
        "definitions": [
            {
                "examples": [],
                "text": "Йәмәғәт транспорты автомобилгә ҡарағанда яхшыраҡ."
            }
        ],
        "id": "ba_elementary_describing_017",
        "word": "Йәмәғәт транспорты автомобилгә ҡарағанда яхшыраҡ."
    },
    {
        "t": "Телефон булғанда күңелһеҙләнеү ҡыйын.",
        "tag": "Technology",
        "h": [
            "Көненә нисә сәғәт телефон ҡулланаһығыҙ?",
            "Уны күбрәк нәмә өсөн ҡулланаһығыҙ?",
            "Смартфондар булғанға тиклем ыеҙгә күңелһеҙ инеме?",
            "Күңелһеҙләнеү ҡайһы ваҡыт яхшымы?",
            "Телефонығыҙҙы бер көнгә өйҙә ҡалдыра алыр инегеҙме?"
        ],
        "level": "elementary",
        "theme": "describing",
        "lang": "ba",
        "form": "phrase",
        "transcription": "",
        "emoji": "💬",
        "definitions": [
            {
                "examples": [],
                "text": "Телефон булғанда күңелһеҙләнеү ҡыйын."
            }
        ],
        "id": "ba_elementary_describing_018",
        "word": "Телефон булғанда күңелһеҙләнеү ҡыйын."
    },
    {
        "t": "Өйҙә ашарға бешереү һәр ваҡыт тышта ашауҙан яхшыраҡ.",
        "tag": "Food",
        "h": [
            "Өйҙә никаҙар йыш бешерәһегеҙ?",
            "Нәмә еңелерәк — бешереүме яки ресторанға барыумы?",
            "Ыеҙ йәшәгән ерҙә тышта ашау ҡыйбатмы?",
            "Ыеҙҙең яратҡан ресторанығыҙ нинди?",
            "Ыеҙҙең иң яхшы өй ризығығыҙ нинди?"
        ],
        "level": "elementary",
        "theme": "describing",
        "lang": "ba",
        "form": "phrase",
        "transcription": "",
        "emoji": "💬",
        "definitions": [
            {
                "examples": [],
                "text": "Өйҙә ашарға бешереү һәр ваҡыт тышта ашауҙан яхшыраҡ."
            }
        ],
        "id": "ba_elementary_describing_019",
        "word": "Өйҙә ашарға бешереү һәр ваҡыт тышта ашауҙан яхшыраҡ."
    },
    {
        "t": "Һәр кем бер йыл сит илдә йәшәп ҡарарға тейеш.",
        "tag": "Travel",
        "h": [
            "Ыеҙ башҡа илдә йәшәнегеҙме?",
            "Сит илдә йәшәүҙең нәмәһе ауыр булар ине?",
            "Нәмәһе ҡызыҡлы булар ине?",
            "Ыеҙ ҡайһы илде һайлар инегеҙ?",
            "Сит илдә йәшәү кешене үзгәртәме?"
        ],
        "level": "elementary",
        "theme": "describing",
        "lang": "ba",
        "form": "phrase",
        "transcription": "",
        "emoji": "💬",
        "definitions": [
            {
                "examples": [],
                "text": "Һәр кем бер йыл сит илдә йәшәп ҡарарға тейеш."
            }
        ],
        "id": "ba_elementary_describing_020",
        "word": "Һәр кем бер йыл сит илдә йәшәп ҡарарға тейеш."
    },
    {
        "t": "Супергеройҙар реаль геройҙарға ҡарағанда ҡызыҡлыраҡ.",
        "tag": "Entertainment",
        "h": [
            "Ыеҙҙең яратҡан супергеройығыҙ кем?",
            "Реаль тормоштан берәр геройҙы иҫкә төшөрә алаһығыҙмы?",
            "Кешене нәмә герой итә?",
            "Ни өсөн кешеләр супергеройҙарҙы яраталар?",
            "Реаль геройҙар мөһимрәкме?"
        ],
        "level": "elementary",
        "theme": "describing",
        "lang": "ba",
        "form": "phrase",
        "transcription": "",
        "emoji": "💬",
        "definitions": [
            {
                "examples": [],
                "text": "Супергеройҙар реаль геройҙарға ҡарағанда ҡызыҡлыраҡ."
            }
        ],
        "id": "ba_elementary_describing_021",
        "word": "Супергеройҙар реаль геройҙарға ҡарағанда ҡызыҡлыраҡ."
    },
    {
        "t": "Һәр иртә урын-ерҙе йыйып ҡуйыу мөһим.",
        "tag": "Daily life",
        "h": [
            "Ыеҙ көн һайын урынығыҙҙы йыяһығыҙмы?",
            "Йыйылған бүлмә ыеҙҙе яхшыраҡ хис иттерәме?",
            "Бу мөһимме яки мөһим түгелме?",
            "Ыеҙҙең иртәнге ғәҙәттәрегеҙ нинди?",
            "Ыеҙҙең нинди кескәй ғәҙәттәрегеҙ бар?"
        ],
        "level": "elementary",
        "theme": "describing",
        "lang": "ba",
        "form": "phrase",
        "transcription": "",
        "emoji": "💬",
        "definitions": [
            {
                "examples": [],
                "text": "Һәр иртә урын-ерҙе йыйып ҡуйыу мөһим."
            }
        ],
        "id": "ba_elementary_describing_022",
        "word": "Һәр иртә урын-ерҙе йыйып ҡуйыу мөһим."
    },
    {
        "t": "Шопинг — бу хобби.",
        "tag": "Free time",
        "h": [
            "Ыеҙгә кибеткә йөрөү ошаймы?",
            "Ыеҙ онлайнмы яки кибеттәрҙәме һатып алаһығыҙ?",
            "Шопингҡа күпме вакыт сарыф итәһегеҙ?",
            "Шопинг тынысландырамы?",
            "Нәмәне йышыраҡ һатып алаһығыҙ?"
        ],
        "level": "elementary",
        "theme": "describing",
        "lang": "ba",
        "form": "phrase",
        "transcription": "",
        "emoji": "💬",
        "definitions": [
            {
                "examples": [],
                "text": "Шопинг — бу хобби."
            }
        ],
        "id": "ba_elementary_describing_023",
        "word": "Шопинг — бу хобби."
    },
    {
        "t": "Бер үҙең сәйәхәт итеү дуҫтар менән сәйәхәт итеүҙән яхшыраҡ.",
        "tag": "Travel",
        "h": [
            "Ыеҙ бер үҙегеҙ сәйәхәт иттегеҙме?",
            "Бер үҙең сәйәхәт итеүҙең нәмәһе яхшы?",
            "Башҡалар менән сәйәхәт итеүҙең нәмәһе яхшы?",
            "Бер үҙегеҙ сәйәхәт иткәндә үҙегеҙҙе ялғыҙ хис итәһегеҙме?",
            "Ыеҙҙең иң яхшы сәйәхәтегеҙ нинди ине?"
        ],
        "level": "elementary",
        "theme": "describing",
        "lang": "ba",
        "form": "phrase",
        "transcription": "",
        "emoji": "💬",
        "definitions": [
            {
                "examples": [],
                "text": "Бер үҙең сәйәхәт итеү дуҫтар менән сәйәхәт итеүҙән яхшыраҡ."
            }
        ],
        "id": "ba_elementary_describing_024",
        "word": "Бер үҙең сәйәхәт итеү дуҫтар менән сәйәхәт итеүҙән яхшыраҡ."
    }
];
    const lang = "ba";
    if (!window.speakingData) window.speakingData = {};
    if (!window.speakingData[lang]) window.speakingData[lang] = {};
    if (!window.speakingData[lang]["opinions"]) window.speakingData[lang]["opinions"] = [];
    window.speakingData[lang]["opinions"].push(...data);
})();